forminst_new1/app/controllers/adecuacions_controller.rb

SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`id` = 19 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 15 LIMIT 1
SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 37 LIMIT 1
SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 37 LIMIT 1
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 38 LIMIT 1
SELECT  `escuela`.* FROM `escuela` WHERE `escuela`.`id` = 2 LIMIT 1
---
  def generar_pdf() # es función permite generar el documento pdf de la adecuación
    @adecuacion= Adecuacion.find(session[:adecuacion_id]) # se obtienen la información de la adecuación seleccionada
    @planformacion= Planformacion.find(@adecuacion.planformacion_id)
    @fechaConcurso = @planformacion.fecha_inicio
    @id_docente= @planformacion.tutor_id # se obtiene el indicador del ususario al que corresponde la adecuación
    @usertutor= Usuario.find(@id_docente) # se obtiene la información del tutor mediante la base de datos y la variable anterior
    @tutor= Persona.where(usuario_id: @id_docente).take
    @id_instructor= @planformacion.instructor_id # se toma el identificador del instructor
    @userinst=Usuario.find(@id_instructor) # se obtienen toda la información del instructor
    @instructor= Persona.where(usuario_id: @id_instructor).take
    @fechaActual = Date.current.to_s
    @userentidad= Usuarioentidad.where(usuario_id: @planformacion.instructor_id).take
      if @userentidad.escuela_id == nil
        @userentidad.escuela_id=12
        @userentidad.save
        @escuela= Escuela.where(id: @userentidad.escuela_id).take

SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 19 AND `adecuacion_actividad`.`semestre` = 1
SELECT  `actividad`.* FROM `actividad` WHERE `actividad`.`id` = 561 LIMIT 1
---
    @dactv_formacion= []
    @dactv_extension=[]

    @actividadesa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 1).all
    @actividadesa.each do |actade|