forminst_new1/app/controllers/administrador_controller.rb

SELECT `entidad`.* FROM `entidad`
SELECT `escuela`.* FROM `escuela`
---
	def agregar_secretaria
		session[:administrador]
		if session[:usuario_id]=="-2552" && session[:administrador] && session[:nombre_usuario]=="Administrador"

			#Todas las Entidades
			cpentidad = Entidad.all
			cpcontador = 0
			@cpentidades = []
			@cpentidades[cpcontador] = Array.new(2) { |i|  }
			@cpentidades[cpcontador][0] =  "Seleccione una entidad"
			@cpentidades[cpcontador][1] = 0
			cpcontador = cpcontador + 1

			cpentidad.each do |entidad|
				if entidad.nombre != "tutor" && entidad.nombre != "instructor"
					@cpentidades[cpcontador] = Array.new(2) { |i|  }
					@cpentidades[cpcontador][0] =  entidad.nombre
					@cpentidades[cpcontador][1] = entidad.id
					cpcontador = cpcontador + 1
				end
			end

			#Todas las Escuelas
			cpescuela = Escuela.all

INSERT INTO `usuario` (`user`, `ldap`, `activo`, `password`, `email`, `tipo`) VALUES ('secretaria.uno', 0, 1, '356a192b7913b04c54574d18c28d46e6395428ab', 'secretaria.uno', 'Secretaria')
INSERT INTO `persona` (`usuario_id`, `nombres`, `apellidos`, `ci`) VALUES (37, 'secretaria', 'Uno', '1')
INSERT INTO `usuarioentidad` (`id`, `usuario_id`, `entidad_id`, `escuela_id`) VALUES (37, 37, 2, 2)
---
	def guardar_secretaria
		session[:administrador]
		if session[:usuario_id]=="-2552" && session[:administrador] && session[:nombre_usuario]=="Administrador"
			clave = params[:CI].to_s
			cpusuario = Usuario.new
			cpusuario.user = params[:correo]
			cpusuario.password = Digest::SHA1.hexdigest(clave)
			cpusuario.ldap = 0
			cpusuario.activo = 1
			cpusuario.tipo = "Secretaria"
			cpusuario.email = params[:correo]
			cpusuario.save

			cppersona = Persona.new
			cppersona.usuario_id = cpusuario.id
			cppersona.nombres = params[:Nombre]
			cppersona.apellidos = params[:Apellido]
			cppersona.ci = params[:CI].to_s
			cppersona.save

			cpuentidad = Usuarioentidad.new
			cpuentidad.usuario_id = cpusuario.id
			cpuentidad.entidad_id = params[:jrentidades]
			cpuentidad.id = cpusuario.id
			cpuentidad.escuela_id = params[:jrescuelas]
			cpuentidad.save

SELECT `entidad`.* FROM `entidad`
---
	def seleccionar_entidad
		session[:administrador]
		if session[:usuario_id]=="-2552" && session[:administrador] && session[:nombre_usuario]=="Administrador"

			#Todas las Entidades
			cpentidad = Entidad.all

SELECT `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`entidad_id` = 1
SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` IS NULL LIMIT 1
---
	def modificar_email
		session[:administrador]
		if session[:usuario_id]=="-2552" && session[:administrador] && session[:nombre_usuario]=="Administrador"
			@entidadId = params[:jrentidades]
			cjpUsuarios = Usuarioentidad.where(entidad_id: params[:jrentidades])
			cjpUsuarios.each do |uentidad|
				if Usuario.where(id: uentidad.usuario_id).take.tipo == "Institucional"

SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 8 LIMIT 1
UPDATE `usuario` SET `email` = 'consejo.compu', `user` = 'consejo.compu' WHERE `usuario`.`id` = 8
---
	def guardar_email
		session[:administrador]
		if session[:usuario_id]=="-2552" && session[:administrador] && session[:nombre_usuario]=="Administrador"

			usuario = Usuario.where(id: $id).take
			usuario.email = params[:email]
			usuario.user = params[:email]
			usuario.save