forminst_new1/app/controllers/documents_controller.rb

  def index
    #pdf_filename = File.join(Rails.root, "tmp/PDFs/18810993-2017-07-02-adecuacion.pdf")
    #send_file(pdf_filename, :filename => "18810993-2017-07-02-adecuacion.pdf", :disposition => 'inline', :type => "application/pdf")
    #validar si se envio la adecuacion
      if session[:usuario_id] && session[:tutor]
        if(!session[:plan_id].blank?)

          @bool_enviado = 0
          @adecuacion = Adecuacion.where(planformacion_id: session[:plan_id]).take
          if session[:informe_id].blank?
            estatus_x = EstatusAdecuacion.where(adecuacion_id: @adecuacion.id, actual: 1).take
          else
            estatus_x = EstatusInforme.where(informe_id: session[:informe_id], actual: 1).take
          end
          if (estatus_x.estatus_id != 6 && estatus_x.estatus_id != 5)
            @bool_enviado = 1
          end
          @plan = Planformacion.where(id: session[:plan_id]).take

          if !@plan.blank?
            #Ver si el informe fue rachazado
            cpInstructor = Usuario.find(@plan.instructor_id)
---
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 15 LIMIT 1
SELECT  `estatus_informe`.* FROM `estatus_informe` WHERE `estatus_informe`.`informe_id` = 57 AND `estatus_informe`.`actual` = 1 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 15 LIMIT 1
SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 39 LIMIT 1

          $actividad = params[:actividad_id].to_i
          @documents = []
          if !session[:informe_id].blank?
            @documents = Document.where("informe_id <= ? AND adecuacion_id = ? AND actividad_id = ?",session[:informe_id].to_i , session[:adecuacion_id],  $actividad).all
---
SELECT `document`.* FROM `document` WHERE `document`.`adecuacion_id` = 19 AND `document`.`informe_id` = 57 AND `document`.`actividad_id` = 561

  def new
    @bool_enviado = 0
    if(!session[:plan_id].blank?)
      @adecuacion = Adecuacion.where(planformacion_id: session[:plan_id]).take
      if session[:informe_id].blank?
        estatus_x = EstatusAdecuacion.where(adecuacion_id: @adecuacion.id, actual: 1).take
      else
        estatus_x = EstatusInforme.where(informe_id: session[:informe_id], actual: 1).take
---
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 15 LIMIT 1
SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 19 AND `estatus_adecuacion`.`actual` = 1 LIMIT 1
SELECT  `estatus_informe`.* FROM `estatus_informe` WHERE `estatus_informe`.`informe_id` = 59 AND `estatus_informe`.`actual` = 1 LIMIT 1

  def create
    if session[:usuario_id] && session[:tutor]
	    if params[:document].present?
        @document = Document.new(document_params)
        @planformacion = Planformacion.find(session[:plan_id])
        @adecuacion = Adecuacion.where(planformacion_id: session[:plan_id]).take
---
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 15 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 15 LIMIT 1

    def set_document
      @document = Document.find(params[:id])
---
SELECT  `document`.* FROM `document` WHERE `document`.`id` = 1 LIMIT 1