forminst_new1/app/controllers/forminst_controller.rb

SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`user` = 'secretaria.uno' LIMIT 1
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 36 LIMIT 1
SELECT  `entidad`.* FROM `entidad` WHERE `entidad`.`id` = 2 LIMIT 1
SELECT `usuario`.* FROM `usuario`
UPDATE `usuario` SET `password` = '0f13c2291d4d099762e38510e4eed302a1fb04d4' WHERE `usuario`.`id` = 43
SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 36 LIMIT 1
---
	def autenticar

		#Conectar con el servidor ldap
		ldap= Net::LDAP.new(:host=>"ciens.ucv.ve",:port=>389, :auth=>{:method=> :simple, :username=>"cn=vmail,dc=ciens,dc=ucv,dc=ve", :password => "Gu4B37hpi5mgdJzkucj4OoszKYoPG1"})
		correo= params[:correo] # se toma el valor correo del ususario
		clave= params[:password] # se toma el valor password del usuario
		#Si es un Administrados
		if correo == "Administrador" && params[:password]=="1"

			session[:usuario_id] = "-2552" #número de usuario para el administrador (usado para no ingresar al modulo con el link)
			session[:nombre_usuario] = "Administrador" #usado para no ingresar al modulo con el link
			session[:administrador] = true
			session[:tutor] = false
			session[:instructor] = false
			session[:entidad] = false
			flash[:success] = "Bienvenido! Administrador"
			redirect_to controller:"administrador", action: "index" #Mostrar el modulo del administrador


		elsif correo!=nil && correo!="" && clave!=nil && clave!="" #verificar que el correo no sea nulo
		result = ldap.bind_as(:base => "dc=ciens, dc=ucv, dc=ve", :filter => "(uid=#{correo})", :password => clave) #Se busca el usuario en el ldap
		@usuario= Usuario.where(user: correo).take #buscar el usuario en la base de datos
			if @usuario #Si el usuario esta registrado
	      		tipo=@usuario.tipo #Guardar el tipo de usuario "Secretaria, Entidad, Vista(No poder modificar en la entidad), tutor e instructor"
				@usuarioe= Usuarioentidad.where(usuario_id: @usuario.id).take
				@entidad= Entidad.find(@usuarioe.entidad_id)
				if @usuario.activo==true #Sber si el usuario no esta bloqueado
					if @usuario.ldap==true && !result.blank? #si el usuario se encuentra en el ldap entonces
						@usuario.password = Digest::SHA1.hexdigest(clave) #Se encripta la clave del usuario para almacenarlo en la base de datos (se usa cuando no funciona el ldap)
						@usuario.save
						#segun el usuario se muestra su modulo y se almacenan los datos de las sesiones
						if tipo=="Secretaria"
							session[:usuario_id]= @usuario.id
							@persona = Persona.where(usuario_id: session[:usuario_id]).take

SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 18 LIMIT 1
---
								session[:instructor]= false
								session[:entidad]= false
								if params[:accion] == "mostrar adecuacion"
									plan = Planformacion.where(id: params[:param1].to_i).take

SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 15 LIMIT 1
---
										@instructorName = @inst.nombres.to_s.split.map(&:capitalize).join(' ') + " " + @inst.apellidos.to_s.split.map(&:capitalize).join(' ')
										session[:instructorName] = @instructorName
										@instructorName = session[:instructorName]
										session[:adecuacion_id] = Adecuacion.where(planformacion_id: session[:plan_id]).take.id

SELECT  `informe`.* FROM `informe` WHERE `informe`.`id` = 65 LIMIT 1
---
										redirect_to controller:"iniciotutor", action: "index"
									end
								elsif params[:accion] == "mostrar informe"
									@inform = Informe.where(id: params[:param2].to_i).take

SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`instructor_id` = 39 LIMIT 1
---
								session[:instructor]= true
								session[:entidad]= false
								if params[:accion] == "mostrar adecuacion"
									if !Planformacion.where(instructor_id: session[:usuario_id]).take.blank?

SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 19 AND `estatus_adecuacion`.`actual` = 1 LIMIT 1
---
								session[:nombre_usuario] = @entidad.nombre

								if params[:accion] == "mostrar adecuacion"
									ea = EstatusAdecuacion.where(adecuacion_id: params[:param3], actual: 1).take.estatus_id