forminst_new1/app/controllers/informes_controller.rb

SELECT  `informe`.* FROM `informe` WHERE `informe`.`planformacion_id` IS NULL AND `informe`.`numero` = 2 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`id` = 19 LIMIT 1
SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 19 AND `estatus_adecuacion`.`actual` = 1 LIMIT 1
SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 19 AND `adecuacion_actividad`.`semestre` = 2
SELECT  `actividad`.* FROM `actividad` WHERE `actividad`.`id` = 569 LIMIT 1
---
  def ver_crear_informe
    @ejecutada = 'ejecutada'
    @observacion = 'observacion'

    if session[:usuario_id] && session[:tutor]
      @informes= Informe.where(planformacion_id: session[:plan_id],numero: params[:informe_id]).take
      if !@informes.blank?
        flash[:danger]= "Este informe ya fue creado"
        redirect_to controller:"informes", action: "listar_informes"
      else
        if session[:adecuacion_id]
          @adecuacion= Adecuacion.find(session[:adecuacion_id])
          esta = EstatusAdecuacion.where(adecuacion_id: session[:adecuacion_id], actual: 1).take
          if esta.estatus_id == 6
            flash[:danger]= "La adecuación debe ser enviada/aproabada para poder crear algun informe"
            redirect_to controller:"informes", action: "listar_informes"
          end
          @actividadesa= []
          @actividadesadoc= []
          @actividadesainv= []
          @actividadesaext= []
          @actividadesafor= []
          @actividadesaotr= []
          @actividadesaobli= []
          @fecha_inicio1 = nil
          @fecha_fin1 = nil
          if params[:informe_id].to_i == 1
            @nombre_informe = "PRIMER SEMESTRAL"
            @tipo_informe=1
            @numero_informe=1
            @actividadesa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 1).all
            @actividadesa.each do |actade|

SELECT  `informe`.* FROM `informe` WHERE `informe`.`id` = 57 LIMIT 1
SELECT  `estatus_informe`.* FROM `estatus_informe` WHERE `estatus_informe`.`informe_id` = 57 AND `estatus_informe`.`actual` = 1 LIMIT 1
SELECT `document`.* FROM `document` WHERE `document`.`adecuacion_id` = 19 AND `document`.`informe_id` = 57
DELETE FROM `document` WHERE `document`.`id` = 1
DELETE FROM `informe` WHERE `informe`.`id` = 57
SELECT `informe_actividad`.* FROM `informe_actividad` WHERE `informe_actividad`.`informe_id` = 57
SELECT  `actividad_ejecutada`.* FROM `actividad_ejecutada` WHERE `actividad_ejecutada`.`informe_actividad_id` = 484 LIMIT 1
DELETE FROM `actividad_ejecutada` WHERE `actividad_ejecutada`.`id` = 303
DELETE FROM `informe_actividad` WHERE `informe_actividad`.`id` = 484
---
  def eliminar_informe
    if !session[:informe_id].blank?
      @informe= Informe.find(session[:informe_id])
      @est= EstatusInforme.where(informe_id: @informe.id, actual: 1).take
      if @est.estatus_id == 6
        @documents = Document.where(adecuacion_id: session[:adecuacion_id], informe_id: session[:informe_id]).all
        @documents.each do |documents|
          documents.destroy
        end
        @informesAct = InformeActividad.where(informe_id: session[:informe_id]).all
        @informesAct.each do |informeAct|
          @actividadEjec= ActividadEjecutada.where(informe_actividad_id: informeAct.id).take
          if !@actividadEjec.blank?
            @actividadEjec.destroy

SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 37 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 15 LIMIT 1
SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 39 LIMIT 1
SELECT  `informe`.* FROM `informe` WHERE `informe`.`id` = 57 LIMIT 1
SELECT  `estatus_informe`.* FROM `estatus_informe` WHERE `estatus_informe`.`informe_id` = 57 AND `estatus_informe`.`actual` = 1 LIMIT 1
SELECT  `tipo_estatus`.* FROM `tipo_estatus` WHERE `tipo_estatus`.`id` = 6 LIMIT 1
---
  def detalles_informe2
    if session[:usuario_id] && session[:tutor]
      @nombre = session[:nombre_usuario]
      @CJagregado = ["no","no","no","no"]
      if not @nombre
        print "NO HAY USUARIO"
      end
      @persona = Persona.where(usuario_id: session[:usuario_id]).take
      if session[:plan_id]
        @planformacion = Planformacion.find(session[:plan_id])
      else
        @planformacion = Planformacion.find(session[:plan_id])
      end

      if !@planformacion.blank?
        #Ver si el informe fue rachazado
        cpInstructor = Usuario.find(@planformacion.instructor_id)
        if (cpInstructor.activo == 0)
          @cpBloquear = true
        else
          @cpBloquear = false
        end
        #fin
      end

      if session[:informe_id]
        @informe= Informe.find(session[:informe_id])
        @estatus= EstatusInforme.where(informe_id: @informe.id, actual: 1).take
        @status= TipoEstatus.find(@estatus.estatus_id)

SELECT `informe_actividad`.* FROM `informe_actividad` WHERE `informe_actividad`.`informe_id` = 57
---
        @docencia= "docencia"
        @j= 0
        @k=0
        @actividadesa= InformeActividad.where(informe_id: @informe.id).all

SELECT `resultado`.* FROM `resultado` WHERE `resultado`.`informe_actividad_id` = 485
---
        @actividadesa.each do |actade|
          if actade.actividad_id == nil #Es el caso que es un resultado no contemplado en el plan de formacion o un avancwe de postgrado
            if @bool_enviado == 0
              @res= Resultado.where(informe_actividad_id: actade.id).all

SELECT  `actividad`.* FROM `actividad` WHERE `actividad`.`id` = 561 LIMIT 1
---
              @resultados2a.push(@resultados2b)
            end
          else
            @act= Actividad.find(actade.actividad_id)

SELECT  `actividad_ejecutada`.* FROM `actividad_ejecutada` WHERE `actividad_ejecutada`.`informe_actividad_id` = 484 LIMIT 1
SELECT  `observacion_tutor`.* FROM `observacion_tutor` WHERE `observacion_tutor`.`informe_actividad_id` = 484 LIMIT 1
SELECT `observacion_actividad_informe`.* FROM `observacion_actividad_informe` WHERE `observacion_actividad_informe`.`informe_actividad_id` = 484
---
              end
              @resultados2a.push(@resultados2b)
            end
            @ae= ActividadEjecutada.where(informe_actividad_id: actade.id).take
            @actividadese.push(@ae)
            @obs= ObservacionTutor.where(informe_actividad_id: actade.id).take
            if @obs==nil
              @observaciont.push("")

              @cpObs= ObservacionActividadInforme.where(informe_actividad_id: actade.id).all

SELECT  `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`actividad_id` = 620 LIMIT 1
---
                end
              end
            end
            semestre = AdecuacionActividad.where(actividad_id: @act.id).take.semestre

SELECT  `tipo_informe`.* FROM `tipo_informe` WHERE `tipo_informe`.`id` = 1 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 15 LIMIT 1
SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 39 LIMIT 1
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 39 LIMIT 1
SELECT  `escuela`.* FROM `escuela` WHERE `escuela`.`id` = 2 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 15 LIMIT 1
SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 39 LIMIT 1
---
def vista_previa
  if session[:informe_id] && session[:tutor]
    @informe= Informe.find(session[:informe_id])
    @TipoSemestre=TipoInforme.where(id: @informe.tipo_id).take
    @fechaActual = Date.current.to_s
    @plan= Planformacion.find(session[:plan_id])


      if !@plan.blank?
        #Ver si el informe fue rachazado
        cpInstructor = Usuario.find(@plan.instructor_id)
        if (cpInstructor.activo == 0)
          @cpBloquear = true
        else
          @cpBloquear = false
        end
        #fin
      end

      @fechaConcurso = @plan.fecha_inicio
    @usere= Usuarioentidad.where(usuario_id: @plan.instructor_id).take
    @escuela= Escuela.find(@usere.escuela_id)
    @adecuacion= Adecuacion.where(planformacion_id: @plan.id).take
    @adscripcion_docencia= @plan.adscripcion_docencia
    @adscripcion_investigacion= @plan.adscripcion_investigacion
    @persona= Persona.where(usuario_id: @plan.instructor_id).take

SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 19 AND `adecuacion_actividad`.`semestre` = 0
SELECT  `actividad`.* FROM `actividad` WHERE `actividad`.`id` = 625 LIMIT 1
SELECT  `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`actividad_id` = 620 LIMIT 1
---
    @actividades1for= []
    @actividades1otr= []

    @actividades1= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 1).all
    @actividades1.each do |actade|

SELECT  `informe_actividad`.* FROM `informe_actividad` WHERE `informe_actividad`.`informe_id` = 60 AND `informe_actividad`.`actividad_id` = 619 LIMIT 1
SELECT `resultado`.* FROM `resultado` WHERE `resultado`.`informe_actividad_id` = 500
---
      else
        if tipo==2
          if @informe.numero == 1
            @resActi= InformeActividad.where(informe_id: @informe.id, actividad_id: @act.id).take
            @res= Resultado.where(informe_actividad_id: @resActi.id).all

SELECT  `estatus_informe`.* FROM `estatus_informe` WHERE `estatus_informe`.`informe_id` = 60 AND `estatus_informe`.`actual` = 1 LIMIT 1
---


    @bool_enviado = 0
    estatus_informe = EstatusInforme.where(informe_id: @informe.id, actual: 1).take

SELECT  `actividad_ejecutada`.* FROM `actividad_ejecutada` WHERE `actividad_ejecutada`.`informe_actividad_id` = 500 LIMIT 1
SELECT  `observacion_tutor`.* FROM `observacion_tutor` WHERE `observacion_tutor`.`informe_actividad_id` = 500 LIMIT 1
---
          end
        end
      end
      @ae= ActividadEjecutada.where(informe_actividad_id: actade.id).take
      @actividadese.push(@ae)
      @obs= ObservacionTutor.where(informe_actividad_id: actade.id).take

SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 37 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 15 LIMIT 1
SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 39 LIMIT 1
SELECT  `informe`.* FROM `informe` WHERE `informe`.`id` = 59 LIMIT 1
---
  def ver_detalles_informe

    if session[:usuario_id] && session[:tutor]
      @nombre = session[:nombre_usuario]
      @persona = Persona.where(usuario_id: session[:usuario_id]).take
      if session[:plan_id]
        @planformacion = Planformacion.find(session[:plan_id])
      else
        @planformacion = Planformacion.find(session[:plan_id])
      end

      if !@planformacion.blank?
        #Ver si el informe fue rachazado
        cpInstructor = Usuario.find(@planformacion.instructor_id)
        if (cpInstructor.activo == 0)
          @cpBloquear = true
        else
          @cpBloquear = false
        end
        #fin
      end

      if params[:informe_id]
        session[:informe_id] = params[:informe_id]
      end

      if session[:informe_id]

        @instructor = Persona.where(usuario_id: @planformacion.instructor_id).take
        @informe= Informe.find(session[:informe_id])

SELECT  `estatus_informe`.* FROM `estatus_informe` WHERE `estatus_informe`.`informe_id` = 59 AND `estatus_informe`.`actual` = 1 LIMIT 1
SELECT  `tipo_estatus`.* FROM `tipo_estatus` WHERE `tipo_estatus`.`id` = 6 LIMIT 1
---
        end

        @periodo = @informe.fecha_inicio.to_s + " al " + @informe.fecha_fin.to_s
        @estatus= EstatusInforme.where(informe_id: @informe.id, actual: 1).take
        @status= TipoEstatus.find(@estatus.estatus_id)

SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 38 LIMIT 1
SELECT  `entidad`.* FROM `entidad` WHERE `entidad`.`id` = 19 LIMIT 1
SELECT  `escuela`.* FROM `escuela` WHERE `escuela`.`id` = 2 LIMIT 1
---
          end
        end

        @userentidad= Usuarioentidad.where(usuario_id: @planformacion.instructor_id).take
        @entidad= Entidad.find(@userentidad.entidad_id)
        @escuela= Escuela.find(@userentidad.escuela_id)

SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 48 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 15 LIMIT 1
---
  def crear_informe

    if session[:usuario_id] && session[:tutor]
      nombre = session[:nombre_usuario]
      if not @nombre
        print "NO HAY USUARIO"
      end
      @persona = Persona.where(usuario_id: session[:usuario_id]).take

      if session[:plan_id]
        @planformacion = Planformacion.find(session[:plan_id])

INSERT INTO `informe` (`planformacion_id`, `tutor_id`, `opinion_tutor`, `conclusiones`, `numero`, `fecha_creacion`, `fecha_inicio`, `fecha_fin`, `fecha_modificacion`, `tipo_id`, `justificaciones`) VALUES (15, 48, '', '', 1, '2017-09-19', '2017-09-13', '2017-09-13', '2017-09-19', 1, '')
UPDATE `informe` SET `estado` = '100' WHERE `informe`.`id` = 57
---
  	    informe.fecha_inicio = informe1.fecha_inicio
  	    informe.fecha_fin = informe2.fecha_fin
  	  end
      informe.save

SELECT  `estatus_informe`.* FROM `estatus_informe` WHERE `estatus_informe`.`informe_id` = 57 AND `estatus_informe`.`actual` = 1 LIMIT 1
---
      ei.save


      @estado =EstatusInforme.where(informe_id: informe.id, actual: 1).take

INSERT INTO `informe_actividad` (`informe_id`, `actividad_id`) VALUES (57, 561)
---
        ae.fecha = Time.now
        ae.actual = 1
        ae.informe_actividad_id = ia.id
        ae.save

INSERT INTO `resultado` (`informe_actividad_id`, `tipo_resultado_id`, `tipo_publicacion`, `titulo`, `autor`, `ano`, `ciudad`, `pais`, `editor`, `url`, `ISBN`) VALUES (491, 1, '1', 'a', 'a', 0, 'a', 'a', 'a', 'a', 'a')
---
        rp = Resultado.new
        rp.tipo_resultado_id = 8
        rp.concepto = params[:postgrado]
        rp.save

SELECT  `tipo_informe`.* FROM `tipo_informe` WHERE `tipo_informe`.`id` = 1 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 15 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 15 LIMIT 1
SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 37 LIMIT 1
SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 37 LIMIT 1
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 38 LIMIT 1
SELECT  `escuela`.* FROM `escuela` WHERE `escuela`.`id` = 2 LIMIT 1
---
def generar_pdf() # es función permite generar el documento pdf de la adecuación
    if session[:plan_id] == nil
      redirect_to controller:"informes", action: "listar_informes"
      flash[:danger]= "Ha ocurrido un error"
    end
    @informe= Informe.find(session[:informe_id])
    @TipoSemestre =TipoInforme.where(id: @informe.tipo_id).take
    @planformacion = Planformacion.find(session[:plan_id])
    @adecuacion = Adecuacion.where(planformacion_id: session[:plan_id]).take
    @fechaConcurso = @planformacion.fecha_inicio
    @id_docente= @planformacion.tutor_id # se obtiene el indicador del ususario al que corresponde la adecuación
    @usertutor= Usuario.find(@id_docente) # se obtiene la información del tutor mediante la base de datos y la variable anterior
    @tutor= Persona.where(usuario_id: @id_docente).take
    @id_instructor= @planformacion.instructor_id # se toma el identificador del instructor
    @userinst=Usuario.find(@id_instructor) # se obtienen toda la información del instructor
    @instructor= Persona.where(usuario_id: @id_instructor).take
    @fechaActual = Date.current.to_s
    @userentidad= Usuarioentidad.where(usuario_id: @planformacion.instructor_id).take
    @dactv_docencia=[]
    @dactv_investigacion=[]
    @dactv_extension=[]
    @dactv_formacion=[]
    @semestres=[]
    if @userentidad.escuela_id == nil
      @userentidad.escuela_id=12
      @userentidad.save
      @escuela= Escuela.where(id: @userentidad.escuela_id).take

SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 19 AND `adecuacion_actividad`.`semestre` = 1
SELECT  `actividad`.* FROM `actividad` WHERE `actividad`.`id` = 561 LIMIT 1
SELECT  `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`actividad_id` = 620 LIMIT 1
---
    @aactv_extension=[]
    @aactv_otras=[]

    @actividadesa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 1).all
    @actividadesa.each do |actade|

SELECT  `informe_actividad`.* FROM `informe_actividad` WHERE `informe_actividad`.`informe_id` = 59 AND `informe_actividad`.`actividad_id` = 562 LIMIT 1
SELECT `resultado`.* FROM `resultado` WHERE `resultado`.`informe_actividad_id` = 504
---
      else
        if tipo==2
          if @informe.numero == 1
            @resActi= InformeActividad.where(informe_id: @informe.id, actividad_id: @act.id).take
            @res= Resultado.where(informe_actividad_id: @resActi.id).all

SELECT  `actividad_ejecutada`.* FROM `actividad_ejecutada` WHERE `actividad_ejecutada`.`informe_actividad_id` = 504 LIMIT 1
SELECT  `observacion_tutor`.* FROM `observacion_tutor` WHERE `observacion_tutor`.`informe_actividad_id` = 504 LIMIT 1
---
            @resultados.push(res)
          end
        end
      @ae= ActividadEjecutada.where(informe_actividad_id: actade.id).take
      @actividadese.push(@ae)
      @obs= ObservacionTutor.where(informe_actividad_id: actade.id).take

SELECT COUNT(*) FROM `respaldo` WHERE `respaldo`.`adecuacion_id` = 19 AND `respaldo`.`informe_id` = 59
---
    @documents = Document.where(adecuacion_id: @adecuacion.id, informe_id: session[:informe_id] ).all
    respaldos = []
    respaldos = Respaldo.where(adecuacion_id: @adecuacion.id, informe_id: session[:informe_id] ).all
    @numeroDeVersion = respaldos.size + 1

SELECT  `informe`.* FROM `informe` WHERE `informe`.`id` = 57 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 15 LIMIT 1
UPDATE `planformacion` SET `fecha_modificacion` = '2017-06-26' WHERE `planformacion`.`id` = 15
UPDATE `informe` SET `opinion_tutor` = 'a', `conclusiones` = 'a', `justificaciones` = 'a' WHERE `informe`.`id` = 57
SELECT  `informe_actividad`.* FROM `informe_actividad` WHERE `informe_actividad`.`informe_id` = 57 AND `informe_actividad`.`actividad_id` = 561 LIMIT 1
SELECT  `actividad_ejecutada`.* FROM `actividad_ejecutada` WHERE `actividad_ejecutada`.`informe_actividad_id` = 484 AND `actividad_ejecutada`.`actual` = 1 LIMIT 1
UPDATE `actividad_ejecutada` SET `descripcion` = 'adsdfsadf' WHERE `actividad_ejecutada`.`id` = 303
---
  def actualizar_informe
    @informe= Informe.find(session[:informe_id])
    @informe.fecha_modificacion = Time.now
    @cant_doc= params[:cant_docencia].to_i
    @cant_inv= params[:cant_investigacion].to_i
    @cant_for= params[:cant_formacion].to_i
    @cant_ext= params[:cant_extension].to_i
    @cant_obli= params[:cant_obligatoria].to_i
    @cant_otr= params[:cant_otra].to_i
    @cant_result= params[:cant_result].to_i
    if !params[:fechaIni].blank?
      @fecha_inicio = params[:fechaIni]
      @informe.fecha_inicio = @fecha_inicio
    end
    if !params[:fechaFin].blank?
      @informe.fecha_fin = params[:fechaFin]
    end
    @informe.opinion_tutor = params[:opinion]
    @informe.conclusiones = params[:conclusiones]
    @informe.justificaciones = params[:justi]
    @plan= Planformacion.find(session[:plan_id])
    @plan.fecha_modificacion = Time.now
    @plan.save
    @informe.save
  #Comienza actividades de docencia
      j=0
      i=:doc.to_s+j.to_s
      @act = params[i].to_i
      while j <  @cant_doc
        ia = InformeActividad.where(informe_id: @informe.id,actividad_id: @act).take

        ejecutada =:ejecutada.to_s+@act.to_s
        if params[ejecutada]!=nil && params[ejecutada]!=""
          ae = ActividadEjecutada.where(informe_actividad_id: ia.id, actual: 1).take
          ae.descripcion = params[ejecutada]
          ae.save

SELECT  `observacion_tutor`.* FROM `observacion_tutor` WHERE `observacion_tutor`.`informe_actividad_id` = 484 LIMIT 1
---

        observacion =:observacion.to_s+@act.to_s

          oa = ObservacionTutor.where(informe_actividad_id: ia.id).take

DELETE FROM `resultado` WHERE `resultado`.`id` = 14
---
      #Actualizará los resultados

      cpi = 1
      cpres= Resultado.destroy_all(informe_actividad_id: ia.id)

INSERT INTO `resultado` (`informe_actividad_id`, `tipo_resultado_id`, `tipo_publicacion`, `titulo`, `autor`, `ano`, `ciudad`, `pais`, `editor`, `url`, `ISBN`) VALUES (485, 1, '1', 'a', 'a', 0, 'a', 'a', 'a', 'a', 'a')
---
          rp = Resultado.new
          rp.tipo_resultado_id = 8
          rp.concepto = params[:postgrado]
          rp.save

SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 37 LIMIT 1
SELECT  `informe`.* FROM `informe` WHERE `informe`.`planformacion_id` = 15 LIMIT 1
SELECT  `estatus_informe`.* FROM `estatus_informe` WHERE `estatus_informe`.`informe_id` = 59 AND `estatus_informe`.`actual` = 1 LIMIT 1
---
  def listar_informes
    if session[:usuario_id]  && session[:tutor]
      @persona = Persona.where(usuario_id: session[:usuario_id]).take
      @nombre = session[:nombre_usuario]
      @planformacion = session[:plan_id]
      @instructorName = session[:instructorName]
      @informes = Informe.where(planformacion_id: @planformacion)
      @informe = Informe.where(planformacion_id: @planformacion).take
      @status = []

      @tipos= []

      @informes.each do |inf|
        si = EstatusInforme.where(informe_id: inf.id, actual: 1).take

SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` IS NULL AND `estatus_adecuacion`.`actual` = 1 LIMIT 1
SELECT  `tipo_informe`.* FROM `tipo_informe` WHERE `tipo_informe`.`id` = 1 LIMIT 1
SELECT  `informe_actividad`.* FROM `informe_actividad` WHERE `informe_actividad`.`informe_id` = 58 AND `informe_actividad`.`actividad_id` = 562 LIMIT 1
SELECT  `actividad`.* FROM `actividad` WHERE `actividad`.`id` = 561 LIMIT 1
SELECT  `actividad_ejecutada`.* FROM `actividad_ejecutada` WHERE `actividad_ejecutada`.`informe_actividad_id` = 484 AND `actividad_ejecutada`.`actual` = 1 LIMIT 1
SELECT `document`.* FROM `document` WHERE `document`.`informe_id` = 57 AND `document`.`adecuacion_id` = 19
---
  def cambiar_estatusI

    cpenviar = "si"

    cpStatus = EstatusAdecuacion.where(adecuacion_id: session[:adecuacion_id], actual: 1).take
    if cpStatus.estatus_id != 1
      cpenviar = "no1"
    end

    cpInformeAVerificar = Informe.find(params[:informe_id].to_i)
    if cpInformeAVerificar.conclusiones.blank?
      cpenviar = "no2"
    end
    if cpInformeAVerificar.opinion_tutor.blank?
      cpenviar = "no3"
    end

    cpActividadAVerificar = InformeActividad.where(informe_id: params[:informe_id].to_i).all
    cpActividadAVerificar.each do |actividadV|
      cpActividadPrueba = Actividad.find(actividadV.actividad_id)
      if cpActividadPrueba.tipo_actividad_id != 5
        cpActividadE = ActividadEjecutada.where(informe_actividad_id: actividadV.id, actual: 1).take
        if cpActividadE.blank?
          cpenviar = "no4"
        elsif cpActividadE.descripcion.blank?
          cpenviar = "no5"
        end
      end
    end

    cpSoporteVerificar = Document.where(informe_id: params[:informe_id].to_i, adecuacion_id: session[:adecuacion_id])

SELECT  `estatus_informe`.* FROM `estatus_informe` WHERE `estatus_informe`.`informe_id` = 58 AND `estatus_informe`.`actual` = 1 LIMIT 1
---
    if cpenviar == "si"

      @informe_id = params[:informe_id].to_i
      cambio_act = EstatusInforme.where(informe_id: @informe_id, actual: 1).take

SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 15 LIMIT 1
---
      cambio_est.informe_id = @informe_id
      cambio_est.fecha = Time.now
      error = 0
      plan = Planformacion.find(session[:plan_id])

UPDATE `informe` SET `justificaciones` = 'Sin Justificaciones' WHERE `informe`.`id` = 58
---
          if @informe.justificaciones.blank?
            @informe.justificaciones = "Sin Justificaciones"
          end
          @informe.save

SELECT COUNT(*) FROM `respaldo` WHERE `respaldo`.`adecuacion_id` = 19 AND `respaldo`.`informe_id` = 58
---

          respaldos = []
          respaldos = Respaldo.where(adecuacion_id: session[:adecuacion_id], informe_id: @informe_id).all
          numeroDeVersion = respaldos.size + 1

SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 48 LIMIT 1
---
          notific.adecuacion_id = session[:adecuacion_id]
          notific.informe_id = @informe_id
          notific.actual = 1
          person = Persona.where(usuario_id: plan.instructor_id).take

INSERT INTO `notificacion` (`instructor_id`, `tutor_id`, `adecuacion_id`, `informe_id`, `actual`, `mensaje`) VALUES (49, 48, 19, 58, 1, '[2017-09-19] El Primer Informe Semestral de Pedro Alejandro se ha enviado a comisión de investigación.')
---
          elsif (cambio_act.estatus_id == 5)
            notific2.mensaje = "[" + notificacionfecha + "] Se ha enviado el " + session[:nombre_informe] + " a Consejo de Facultad."
          end
          notific2.save

SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 48 LIMIT 1
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 49 LIMIT 1
SELECT  `escuela`.* FROM `escuela` WHERE `escuela`.`id` = 2 LIMIT 1
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`escuela_id` = 2 AND `usuarioentidad`.`entidad_id` = 8 LIMIT 1
---
            notific3.mensaje = "[" + notificacionfecha + "] Ha recibido un nuevo Informe: ' " + session[:nombre_informe]+ " ' de " + person.nombres.to_s.split.map(&:capitalize).join(' ') + " " + person.apellidos.to_s.split.map(&:capitalize).join(' ') + ", favor revisar."
          end
          notific3.save
          userr= Usuario.where(id: session[:usuario_id]).take
          user =Usuarioentidad.where(usuario_id: userr.id).take
          if(user.escuela_id == 1)
            uentidad = Usuarioentidad.where(escuela_id: user.escuela_id, entidad_id: 7).take

SELECT  `informe_actividad`.* FROM `informe_actividad` WHERE `informe_actividad`.`informe_id` = 60 AND `informe_actividad`.`actividad_id` = 620 LIMIT 1
SELECT `observacion_actividad_informe`.* FROM `observacion_actividad_informe` WHERE `observacion_actividad_informe`.`informe_actividad_id` = 500
---
  def mas_observaciones

    @boolobs= 0
    @booltutor = 0
    @informe_id = params[:informe_id].to_i
    @actividad_id = params[:actividad_id].to_i
    ia = InformeActividad.where(informe_id: @informe_id, actividad_id: @actividad_id).take


    @observaciones = ObservacionActividadInforme.where(informe_actividad_id: ia.id).all

SELECT  `observacion_tutor`.* FROM `observacion_tutor` WHERE `observacion_tutor`.`informe_actividad_id` = 500 LIMIT 1
---
      end
    end

      @obs_t= ObservacionTutor.where(informe_actividad_id: ia.id).take