forminst_new1/app/controllers/informes_controller.rb

SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 15 LIMIT 1
---
      cambio_est.fecha = Time.now
      error = 0
      plan = Planformacion.where(id: session[:plan_id]).take
      adec = Adecuacion.where(planformacion_id: session[:plan_id]).take