forminst_new1/app/controllers/inicioinstructor_controller.rb

	def listar_informes
	    if session[:usuario_id] && session[:instructor]= true

	      @persona = Persona.where(usuario_id: session[:usuario_id]).take
---
SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 49 LIMIT 1