forminst_new1/app/controllers/iniciotutor_controller.rb

SELECT `notificacion`.* FROM `notificacion` WHERE `notificacion`.`tutor_id` = 37
---
	def index
		session[:tutor]
		if session[:usuario_id] && session[:tutor]
			session[:adecuacion_id] = nil
			session[:plan_id] = nil
			session[:instructorName] = nil

			@nombre = session[:nombre_usuario]
			if not @nombre
				print "NO HAY USUARIO"
			end
			@notificaciones1= []
		    @notificaciones = Notificacion.where(tutor_id: session[:usuario_id]).all

SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 37 LIMIT 1
SELECT `planformacion`.* FROM `planformacion` WHERE `planformacion`.`tutor_id` = 37
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 15 LIMIT 1
SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 19 AND `estatus_adecuacion`.`actual` = 1 LIMIT 1
---
	def planformacions
		if session[:usuario_id] && session[:tutor]
			session[:adecuacion_id] = nil
			@persona = Persona.where(usuario_id: session[:usuario_id]).take
    		@planformacions = Planformacion.where(tutor_id: session[:usuario_id])
    		@nombreinstructor = []
			@status = []
			@cpenviado = []
			@planformacions.each do |plan|
				@person= Persona.where(usuario_id: plan.instructor_id).take
				@nombreinstructor.push(@tutor = @person.nombres.to_s.split.map(&:capitalize).join(' ') + " " + @person.apellidos.to_s.split.map(&:capitalize).join(' '))

				adecuacion = Adecuacion.where(planformacion_id: plan.id).take
				@est= EstatusAdecuacion.where(adecuacion_id: adecuacion.id, actual: 1).take

SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 37 LIMIT 1
---
	def prorroga
		if session[:usuario_id] && session[:tutor]
			session[:adecuacion_id] = nil
			@persona = Persona.where(usuario_id: session[:usuario_id]).take

SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 15 LIMIT 1
SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 38 LIMIT 1
SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 38 LIMIT 1
---
	def ver_detalles_adecuacion
		if session[:usuario_id] && session[:tutor]
			session[:informe_id] = nil
			if !params[:plan_id].blank?
				session[:plan_id] = params[:plan_id]
			end
			if params[:editar] == 'no'
				session[:editar]= false
			else
				session[:editar]= true
			end
			@tutoresAnteriores = Instructortutor.where(instructor_id: session[:usuario_id], actual: 0)
			@nombre = session[:nombre_usuario]
			@planformacion = Planformacion.find(session[:plan_id])

			if !@planformacion.blank?
				#Ver si el informe fue rachazado
				cpInstructor = Usuario.find(@planformacion.instructor_id)
				if (cpInstructor.activo == false)
					@cpBloquear = true
				else
					@cpBloquear = false
				end
				#fin
			end

			@inst = Persona.where(usuario_id: @planformacion.instructor_id).take

SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 38 LIMIT 1
SELECT  `escuela`.* FROM `escuela` WHERE `escuela`.`id` = 2 LIMIT 1
---
			@nombre = session[:nombre_usuario]
			@instructorName = session[:instructorName]
			@plan= Planformacion.find(session[:plan_id])
			@userentidad= Usuarioentidad.where(usuario_id: @plan.instructor_id).take
			@escuela= Escuela.where(id: @userentidad.escuela_id).take

SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 15 LIMIT 1
---
				session[:adecuacion_id]= params[:adecuacion_id]
				@adecuacion= Adecuacion.find(session[:adecuacion_id])
			else
				@adecuacion= Adecuacion.where(planformacion_id: session[:plan_id]).take

INSERT INTO `actividad` (`tipo_actividad_id`, `actividad`) VALUES (1, 'cumplirá con las actividades\r\ndocentes de pregrado que sean asignadas por el Departamento de Computación,\r\nespecíficamente en el dictado de asignaturas básicas asignadas y/o asignaturas de la\r\nOpción Profesional en Tecnología de la Comunicación y Redes soportadas por el\r\ncentro de investigación CICORE.')
UPDATE `actividad` SET `actividad` = 'Dictar la carga docente en el semestre correspondiente asignada por el Departamento de Computación o una asignatura electiva de la Opción Profesional en Tecnología de la Comunicación y Redes.' WHERE `actividad`.`id` = 561
---
					cpActividad = Actividad.new
					cpActividad.tipo_actividad_id = 9
					cpActividad.actividad = params[:presentacion]
					cpActividad.save

INSERT INTO `adecuacion_actividad` (`adecuacion_id`, `actividad_id`, `semestre`) VALUES (19, 561, 1)
UPDATE `adecuacion` SET `fecha_modificacion` = '2017-06-19' WHERE `adecuacion`.`id` = 19
---
					cpActividadAdecuacion.adecuacion_id = session[:adecuacion_id]
					cpActividadAdecuacion.actividad_id = cpActividad.id
					cpActividadAdecuacion.semestre = 0
					cpActividadAdecuacion.save

SELECT  `actividad`.* FROM `actividad` WHERE `actividad`.`id` = 561 LIMIT 1
---
				while j < params[:cant_edit].to_i
					if @edit == "presentacion"
						if !params[:presentacionId].blank?
							cpActividad = Actividad.find(params[:presentacionId])

DELETE FROM `actividad` WHERE `actividad`.`id` = 611
DELETE FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`id` = 449
SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`actividad_id` = 611
---
				i=:delete.to_s+j.to_s;
				@delete = params[i].to_i
				while j < @cant_delete.to_i
					AdecuacionActividad.where(actividad_id: @delete).destroy_all

INSERT INTO `actividad` (`tipo_actividad_id`, `actividad`) VALUES (9, 'asdasd')
INSERT INTO `adecuacion_actividad` (`adecuacion_id`, `actividad_id`, `semestre`) VALUES (19, 561, 0)
---
	def guardar_primera_parte

		if session[:usuario_id] && session[:tutor]
			#Guardar primera parte del informe
			if !params[:firtsPart].blank?

				#Presentacion
				if params[:presentacionId].blank?
					cpActividad = Actividad.new
					cpActividad.tipo_actividad_id = 9
					cpActividad.actividad = params[:presentacion]
					cpActividad.save
					cpActividadAdecuacion = AdecuacionActividad.new
					cpActividadAdecuacion.adecuacion_id = session[:adecuacion_id]
					cpActividadAdecuacion.actividad_id = cpActividad.id
					cpActividadAdecuacion.semestre = 0
					cpActividadAdecuacion.save

UPDATE `actividad` SET `actividad` = 'asdas<<' WHERE `actividad`.`id` = 574
---
					cpActividad = Actividad.new
					cpActividad.tipo_actividad_id = 1
					cpActividad.actividad = params[:docencia]
					cpActividad.save

SELECT  `actividad`.* FROM `actividad` WHERE `actividad`.`id` = NULL LIMIT 1
---
				while j < params[:cant_edit].to_i
					if @edit == "presentacion"
						if !params[:presentacionId].blank?
							cpActividad = Actividad.find(params[:presentacionId])

SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 15 LIMIT 1
SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 39 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 15 LIMIT 1
SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 39 LIMIT 1
SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 19 AND `estatus_adecuacion`.`actual` = 1 LIMIT 1
---
	def detalles_adecuacion2

		if session[:usuario_id] && session[:tutor]
			if params[:plan_id]
				@planformacion = Planformacion.find(params[:plan_id])
				session[:plan_id] = @planformacion.id
				@inst = Persona.where(usuario_id: @planformacion.instructor_id).take
				@instructorName = @inst.nombres.to_s.split.map(&:capitalize).join(' ') + " " + @inst.apellidos.to_s.split.map(&:capitalize).join(' ')
				session[:instructorName] = @instructorName
				@adecuacion = Adecuacion.where(planformacion_id: session[:plan_id]).take
				session[:adecuacion_id]= @adecuacion.id
			else
				@planformacion = Planformacion.find(session[:plan_id])
			end

			if !@planformacion.blank?
				#Ver si el informe fue rachazado
				cpInstructor = Usuario.find(@planformacion.instructor_id)
				if (cpInstructor.activo == false)
					@cpBloquear = true
				else
					@cpBloquear = false
				end
				#fin
			end

			@adecuacion = Adecuacion.where(planformacion_id: session[:plan_id]).take
			if params[:editar] == 'no'
				session[:editar]= false
			end
			@est= EstatusAdecuacion.where(adecuacion_id: @adecuacion.id, actual: 1).take

SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 19 AND `adecuacion_actividad`.`semestre` = 0
SELECT  `actividad`.* FROM `actividad` WHERE `actividad`.`id` = 573 LIMIT 1
---
			@actividadesaotr= []
			@observacionesExtras= []
			@j=0
			@actividadesa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 0).all
			@actividadesa.each do |actade|

SELECT `observacion_actividad_adecuacion`.* FROM `observacion_actividad_adecuacion` WHERE `observacion_actividad_adecuacion`.`adecuacionactividad_id` = 460
---
			end
			@actividadesa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 0).all
			@actividadesa.each do |actade|
				@cpObs= ObservacionActividadAdecuacion.where(adecuacionactividad_id: actade.id).all

SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 15 LIMIT 1
SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 38 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 15 LIMIT 1
SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 39 LIMIT 1
SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 19 AND `estatus_adecuacion`.`actual` = 1 LIMIT 1
---
	def detalles_adecuacion3

		if session[:usuario_id] && session[:tutor]
			if params[:plan_id]
				@planformacion = Planformacion.find(params[:plan_id])
				session[:editar]= true
				session[:plan_id] = @planformacion.id
				@instructorName = Persona.where(usuario_id: @planformacion.instructor_id).take.nombres
				session[:instructorName] = @instructorName
				@adecuacion = Adecuacion.where(planformacion_id: session[:plan_id]).take
				session[:adecuacion_id]= @adecuacion.id
			else
				@planformacion = Planformacion.find(session[:plan_id])
			end

			if !@planformacion.blank?
				#Ver si el informe fue rachazado
				cpInstructor = Usuario.find(@planformacion.instructor_id)
				if (cpInstructor.activo == false)
					@cpBloquear = true
				else
					@cpBloquear = false
				end
				#fin
			end

			@adecuacion = Adecuacion.where(planformacion_id: session[:plan_id]).take
			if params[:editar] == 'no'
				session[:editar]= false
			end
			@est= EstatusAdecuacion.where(adecuacion_id: @adecuacion.id, actual: 1).take

SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 19 AND `adecuacion_actividad`.`semestre` = 1
SELECT  `actividad`.* FROM `actividad` WHERE `actividad`.`id` = 561 LIMIT 1
---
			@actividadesaotr= []
			@observacionesExtras= []
			@j=0
			@actividadesa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 1).all
			@actividadesa.each do |actade|

SELECT `observacion_actividad_adecuacion`.* FROM `observacion_actividad_adecuacion` WHERE `observacion_actividad_adecuacion`.`adecuacionactividad_id` = 1
---
			end
			@actividadesa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 1).all
			@actividadesa.each do |actade|
				@cpObs= ObservacionActividadAdecuacion.where(adecuacionactividad_id: actade.id).all

SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 15 LIMIT 1
SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 19 AND `estatus_adecuacion`.`actual` = 1 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 15 LIMIT 1
SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 40 LIMIT 1
---
	def detalles_adecuacion4
		if session[:usuario_id] && session[:tutor]
			@iddoc= 'id_docencia'
			@docencia='docencia'
			@investigacion= 'investigacion'
			@formacion= 'formacion'
			@extension= 'extension'
			@otra= 'otra'
			@adecuacion = Adecuacion.where(planformacion_id: session[:plan_id]).take
			@est= EstatusAdecuacion.where(adecuacion_id: @adecuacion.id, actual: 1).take
			if !session[:editar] && (@est.estatus_id == 6 || @est.estatus_id == 5)
				flash.now[:info]= "Para editar la Adecuación debe seleccionar Modificar Adecuación"
			end
			@nombre = session[:nombre_usuario]
			@instructorName = session[:instructorName]
			@plan= Planformacion.find(session[:plan_id])
			@planformacion = Planformacion.find(session[:plan_id])
			if !@planformacion.blank?
				#Ver si el informe fue rachazado
				cpInstructor = Usuario.find(@planformacion.instructor_id)

SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 19 AND `adecuacion_actividad`.`semestre` = 2
SELECT  `actividad`.* FROM `actividad` WHERE `actividad`.`id` = 569 LIMIT 1
---
			@actividadesafor= []
			@actividadesaotr= []
			@observacionesExtras= []
			@actividadesa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 2).all
			@actividadesa.each do |actade|

SELECT `observacion_actividad_adecuacion`.* FROM `observacion_actividad_adecuacion` WHERE `observacion_actividad_adecuacion`.`adecuacionactividad_id` = 466
---
			end
			@actividadesa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 2).all
			@actividadesa.each do |actade|
				@cpObs= ObservacionActividadAdecuacion.where(adecuacionactividad_id: actade.id).all

SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 15 LIMIT 1
SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 40 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 15 LIMIT 1
SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 19 AND `estatus_adecuacion`.`actual` = 1 LIMIT 1
SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 19 AND `adecuacion_actividad`.`semestre` = 3
---
	def detalles_adecuacion5
		if session[:usuario_id] && session[:tutor]
			@iddoc= 'id_docencia'
			@docencia='docencia'
			@investigacion= 'investigacion'
			@formacion= 'formacion'
			@extension= 'extension'
			@otra= 'otra'
			@nombre = session[:nombre_usuario]
			@instructorName = session[:instructorName]
			@plan= Planformacion.find(session[:plan_id])

			@planformacion = Planformacion.find(session[:plan_id])
			if !@planformacion.blank?
				#Ver si el informe fue rachazado
				cpInstructor = Usuario.find(@planformacion.instructor_id)
				if (cpInstructor.activo == false)
					@cpBloquear = true
				else
					@cpBloquear = false
				end
				#fin
			end

			@actividadesadoc= []
			@actividadesainv= []
			@actividadesaext= []
			@actividadesafor= []
			@actividadesaotr= []
			@observacionesExtras= []
			@adecuacion = Adecuacion.where(planformacion_id: session[:plan_id]).take
			@est= EstatusAdecuacion.where(adecuacion_id: @adecuacion.id, actual: 1).take
			if !session[:editar] && (@est.estatus_id == 6 || @est.estatus_id == 5)
				flash.now[:info]= "Para editar la Adecuación debe seleccionar Modificar Adecuación"
			end
			@actividadesa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 3).all

SELECT  `actividad`.* FROM `actividad` WHERE `actividad`.`id` = 636 LIMIT 1
---
			d= false
			e= false
			@actividadesa.each do |actade|
				@act= Actividad.find(actade.actividad_id)

SELECT `observacion_actividad_adecuacion`.* FROM `observacion_actividad_adecuacion` WHERE `observacion_actividad_adecuacion`.`adecuacionactividad_id` = 471
---
			end
			@actividadesa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 3).all
			@actividadesa.each do |actade|
				@cpObs= ObservacionActividadAdecuacion.where(adecuacionactividad_id: actade.id).all

SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 15 LIMIT 1
SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 40 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 15 LIMIT 1
SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 19 AND `estatus_adecuacion`.`actual` = 1 LIMIT 1
SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 19 AND `adecuacion_actividad`.`semestre` = 4
SELECT  `actividad`.* FROM `actividad` WHERE `actividad`.`id` = 578 LIMIT 1
---
	def detalles_adecuacion6
		if session[:usuario_id] && session[:tutor]
			@iddoc= 'id_docencia'
			@docencia='docencia'
			@investigacion= 'investigacion'
			@formacion= 'formacion'
			@extension= 'extension'
			@otra= 'otra'
			@nombre = session[:nombre_usuario]
			@instructorName = session[:instructorName]
			@plan= Planformacion.find(session[:plan_id])

			@planformacion = Planformacion.find(session[:plan_id])
			if !@planformacion.blank?
				#Ver si el informe fue rachazado
				cpInstructor = Usuario.find(@planformacion.instructor_id)
				if (cpInstructor.activo == false)
					@cpBloquear = true
				else
					@cpBloquear = false
				end
				#fin
			end

			@actividadesadoc= []
			@actividadesainv= []
			@actividadesaext= []
			@actividadesafor= []
			@actividadesaotr= []
			@observacionesExtras= []
			@adecuacion = Adecuacion.where(planformacion_id: session[:plan_id]).take
			@est= EstatusAdecuacion.where(adecuacion_id: @adecuacion.id, actual: 1).take
			if !session[:editar] && (@est.estatus_id == 6 || @est.estatus_id == 5)
				flash.now[:info]= "Para editar la Adecuación debe seleccionar Modificar Adecuación"
			end
			@actividadesa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 4).all
			if @actividadesa.blank?

SELECT `observacion_actividad_adecuacion`.* FROM `observacion_actividad_adecuacion` WHERE `observacion_actividad_adecuacion`.`adecuacionactividad_id` = 476
---
			end
			@actividadesa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 4).all
			@actividadesa.each do |actade|
				@cpObs= ObservacionActividadAdecuacion.where(adecuacionactividad_id: actade.id).all

SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 17 LIMIT 1
SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 40 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 17 LIMIT 1
SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 21 AND `estatus_adecuacion`.`actual` = 1 LIMIT 1
SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 21 AND `adecuacion_actividad`.`semestre` = 4
SELECT  `actividad`.* FROM `actividad` WHERE `actividad`.`id` = 610 LIMIT 1
---
	def detalles_adecuacion7
		if session[:usuario_id] && session[:tutor]
			@iddoc= 'id_docencia'
			@docencia='docencia'
			@investigacion= 'investigacion'
			@formacion= 'formacion'
			@extension= 'extension'
			@otra= 'otra'
			@nombre = session[:nombre_usuario]
			@instructorName = session[:instructorName]
			@plan= Planformacion.find(session[:plan_id])

			@planformacion = Planformacion.find(session[:plan_id])
			if !@planformacion.blank?
				#Ver si el informe fue rachazado
				cpInstructor = Usuario.find(@planformacion.instructor_id)
				if (cpInstructor.activo == false)
					@cpBloquear = true
				else
					@cpBloquear = false
				end
				#fin
			end

			@actividadesadoc= []
			@actividadesainv= []
			@actividadesaext= []
			@actividadesafor= []
			@actividadesaotr= []
			@observacionesExtras= []
			@adecuacion = Adecuacion.where(planformacion_id: session[:plan_id]).take
			@est= EstatusAdecuacion.where(adecuacion_id: @adecuacion.id, actual: 1).take
			if !session[:editar] && (@est.estatus_id == 6 || @est.estatus_id == 5)
				flash.now[:info]= "Para editar la Adecuación debe seleccionar Modificar Adecuación"
			end
			@actividadesa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 5).all
			if @actividadesa.blank?

SELECT `observacion_actividad_adecuacion`.* FROM `observacion_actividad_adecuacion` WHERE `observacion_actividad_adecuacion`.`adecuacionactividad_id` = 481
---
			end
			@actividadesa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 5).all
			@actividadesa.each do |actade|
				@cpObs= ObservacionActividadAdecuacion.where(adecuacionactividad_id: actade.id).all

SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 15 LIMIT 1
SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 38 LIMIT 1
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 38 LIMIT 1
SELECT  `escuela`.* FROM `escuela` WHERE `escuela`.`id` = 2 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 15 LIMIT 1
SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 38 LIMIT 1
---
	def vista_previa
		if session[:usuario_id] && session[:tutor]
			@fechaActual = Date.current.to_s
			@plan= Planformacion.find(session[:plan_id])


			if !@plan.blank?
				#Ver si el informe fue rachazado
				cpInstructor = Usuario.find(@plan.instructor_id)
				if (cpInstructor.activo == false)
					@cpBloquear = true
				else
					@cpBloquear = false
				end
				#fin
			end

			@fechaConcurso = @plan.fecha_inicio
			@usere= Usuarioentidad.where(usuario_id: @plan.instructor_id).take
			@escuela= Escuela.find(@usere.escuela_id)
			@adecuacion= Adecuacion.where(planformacion_id: @plan.id).take
			@adscripcion_docencia= @plan.adscripcion_docencia
			@adscripcion_investigacion= @plan.adscripcion_investigacion
			@persona= Persona.where(usuario_id: @plan.instructor_id).take

SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 19 AND `adecuacion_actividad`.`semestre` = 1
SELECT  `actividad`.* FROM `actividad` WHERE `actividad`.`id` = 561 LIMIT 1
---

			@nombre = session[:nombre_usuario]
			@instructorName = session[:instructorName]
			actividades = AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 0)
			if !actividades.blank?

SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`id` = 19 LIMIT 1
SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 19 AND `estatus_adecuacion`.`actual` = 1 LIMIT 1
SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 19 AND `adecuacion_actividad`.`semestre` = 1
SELECT  `actividad`.* FROM `actividad` WHERE `actividad`.`id` = 561 LIMIT 1
---
	def cambiar_estatusA
		if session[:usuario_id] && session[:tutor]
	 		@adecuacion_id = params[:adecuacion_id].to_i
	 		@actividades1doc= []
			@actividades1inv= []
			@actividades1ext= []
			@actividades1for= []
			@actividades1otr= []
			g=0;
		    cambio_act = EstatusAdecuacion.where(adecuacion_id: @adecuacion_id, actual: 1).take

			if (cambio_act.estatus_id != 6 && cambio_act.estatus_id != 5)
		    	flash[:info]="Esta adecuación ya habia sido enviada"
		   	   	redirect_to controller:"iniciotutor", action: "planformacions"
		   	else
				@actividades1= AdecuacionActividad.where(adecuacion_id: @adecuacion_id, semestre: 1).all
				if @actividades1.blank?

INSERT INTO `actividad` (`tipo_actividad_id`, `actividad`) VALUES (5, 'Ninguna')
---
					a = Actividad.new
					a.tipo_actividad_id = 5
					a.actividad = "Ninguna"
					a.save

SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 15 LIMIT 1
---
					end
			   	   	redirect_to controller:"iniciotutor", action: "detalles_adecuacion3"
			   	else
					plan = Planformacion.find(session[:plan_id])

SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 38 LIMIT 1
---
			        notific.adecuacion_id = session[:adecuacion_id]
			        notific.informe_id = nil
			        notific.actual = 1
			        person = Persona.where(usuario_id: plan.instructor_id).take

INSERT INTO `notificacion` (`instructor_id`, `tutor_id`, `adecuacion_id`, `actual`, `mensaje`) VALUES (38, 37, 19, 1, '[2017-06-21] La adecuación de Miguel Angel Astor Romero se ha enviado a comisión de investigación.')
---
			   		elsif (cambio_act.estatus_id == 5)
		        		notific.mensaje = "[" + notificacionfecha + "] La adecuación de "+ person.nombres.to_s.split.map(&:capitalize).join(' ') + " " + person.apellidos.to_s.split.map(&:capitalize).join(' ') + " se ha enviado a Consejo de Facultad para ser revisado nuevamente."
			        end
		        	notific.save

SELECT COUNT(*) FROM `respaldo` WHERE `respaldo`.`adecuacion_id` = 19 AND `respaldo`.`informe_id` IS NULL
---
			        notific.save
    				respaldos = []
				    respaldos = Respaldo.where(adecuacion_id: @adecuacion_id, informe_id: nil).all
				   	numeroDeVersion = respaldos.size + 1

SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 37 LIMIT 1
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 38 LIMIT 1
SELECT  `escuela`.* FROM `escuela` WHERE `escuela`.`id` = 2 LIMIT 1
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`escuela_id` = 2 AND `usuarioentidad`.`entidad_id` = 8 LIMIT 1
---
			        cambio_est.save

			        if (cambio_act.estatus_id == 6)
			          	userr= Usuario.where(id: session[:usuario_id]).take
			         	 user =Usuarioentidad.where(usuario_id: userr.id).take
			         	if(user.escuela_id == 1)
			         		uentidad = Usuarioentidad.where(escuela_id: user.escuela_id, entidad_id: 7).take

SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`id` = 1 LIMIT 1
SELECT  `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 1 AND `adecuacion_actividad`.`semestre` = 1 AND `adecuacion_actividad`.`actividad_id` = 3 LIMIT 1
SELECT `observacion_actividad_adecuacion`.* FROM `observacion_actividad_adecuacion` WHERE `observacion_actividad_adecuacion`.`adecuacionactividad_id` = 3
---
	def mas_observaciones3 #mas obs de actividades del informe

		@adecuacion= Adecuacion.find(session[:adecuacion_id])
		@planformacion=Planformacion.find(@adecuacion.planformacion_id)
		if !@planformacion.blank?
			#Ver si el informe fue rachazado
			cpInstructor = Usuario.find(@planformacion.instructor_id)
			if (cpInstructor.activo == false)
				@cpBloquear = true
			else
				@cpBloquear = false
			end
			#fin
		end

		@semestre = params[:semestre].to_i
 		@actividad_id = params[:actividad_id].to_i

		aa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: @semestre, actividad_id: @actividad_id).take

		@observaciones = ObservacionActividadAdecuacion.where(adecuacionactividad_id: aa.id)

SELECT  `revision`.* FROM `revision` WHERE `revision`.`id` = 1 LIMIT 1
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 3 LIMIT 1
---

		@observaciones.each do |obs|

			rev = Revision.find(obs.revision_id)

			entidad = Usuarioentidad.where(usuario_id: rev.usuario_id).take

SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 15 LIMIT 1
SELECT `respaldo`.* FROM `respaldo` WHERE `respaldo`.`adecuacion_id` = 19 AND `respaldo`.`informe_id` IS NULL
---
	def ver_respaldos
		if session[:usuario_id] && session[:tutor]
		  @plan = Planformacion.where(id: session[:plan_id]).take
		  if !@plan.blank?
			#Ver si el informe fue rachazado
			cpInstructor = Usuario.find(@plan.instructor_id)
			if (cpInstructor.activo == false)
				@cpBloquear = true
			else
				@cpBloquear = false
			end
			#fin
		  end
		  @documents = []
		  if !session[:informe_id].blank?
		    @documents = Respaldo.where(adecuacion_id: session[:adecuacion_id], informe_id: session[:informe_id]).all

SELECT `notificacion`.* FROM `notificacion` WHERE `notificacion`.`tutor_id` = 37
---
	def notificaciones #mas obs de actividades del informe
		if session[:usuario_id] && session[:tutor]
    		@planformacions = Planformacion.where(tutor_id: session[:usuario_id])
    		@notificaciones1= []
			@notificaciones = Notificacion.where( tutor_id: session[:usuario_id]).all