forminst_new1/app/controllers/inicioentidad_controller.rb

SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`entidad_id` = 8 LIMIT 1
---
	def index
		if session[:usuario_id] && session[:entidad]= true
			session[:adecuacion_id] = nil
			session[:plan_id] = nil
			session[:instructorName] = nil
			session[:informe_id]=nil
			@cjpTipo=Usuario.find(session[:usuario_id]).tipo
			@nombre = session[:nombre_usuario]
			@usu=Usuarioentidad.where(entidad_id: session[:entidad_id]).take