forminst_new1/app/controllers/inicioinstructor_controller.rb

  def index
    if session[:usuario_id] && session[:instructor] == true #verificar que no ingresara con el link del modulo
      plan = Planformacion.where(instructor_id: session[:usuario_id]).take #Se busca  el plan de formación del instructor
      session[:adecuacion_id] = Adecuacion.where(planformacion_id: plan.id).take.id #se busca la adecuacion del instructor
      session[:plan_id] = plan.id #se alamacena el plan de formación
      session[:instructorName] = nil
      session[:informe_id] = nil
      @nombre = session[:nombre_usuario]
      #almacenar las notificaciones del usuario para mostrarlas
      @notificaciones1= []
      @notificaciones = Notificacion.where(instructor_id: session[:usuario_id]).all
---
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`instructor_id` = 49 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 15 LIMIT 1
SELECT `notificacion`.* FROM `notificacion` WHERE `notificacion`.`instructor_id` = 49

  def ver_soporte
    @plan = Planformacion.where(id: session[:plan_id]).take #buscar planformacion de instructor
    $actividad = params[:actividad_id].to_i
    @documents = []
    #si son los soportes de un informe
    if !session[:informe_id].blank?
      @documents = Document.where("informe_id <= ? AND adecuacion_id = ? AND actividad_id = ?",session[:informe_id] , session[:adecuacion_id],  $actividad).all
---
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 15 LIMIT 1
SELECT `document`.* FROM `document` WHERE `document`.`adecuacion_id` = 19 AND `document`.`informe_id` = 60 AND `document`.`actividad_id` = 0

	def listar_adecuaciones
		if session[:usuario_id] && session[:instructor] == true
			@nombre = session[:nombre_usuario]

			@plan_formacion = Planformacion.where(instructor_id: session[:usuario_id]).take
			@adecuacion = Adecuacion.where(planformacion_id: @plan_formacion).take
			@tutor1 = Persona.where(usuario_id: @adecuacion.tutor_id).take
      @tutor = @tutor1.nombres.to_s.split.map(&:capitalize).join(' ') + " " + @tutor1.apellidos.to_s.split.map(&:capitalize).join(' ')
			@status_adecuacion = EstatusAdecuacion.where(adecuacion_id: @adecuacion.id, actual: 1).take
			@tipo_status = "[" + @status_adecuacion.fecha.to_s  + "]: " + TipoEstatus.where(id: @status_adecuacion.estatus_id, ).take.concepto
---
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`instructor_id` = 49 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 15 LIMIT 1
SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 48 LIMIT 1
SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 19 AND `estatus_adecuacion`.`actual` = 1 LIMIT 1
SELECT  `tipo_estatus`.* FROM `tipo_estatus` WHERE `tipo_estatus`.`id` = 6 LIMIT 1

	def prorrogas
		if session[:usuario_id] && session[:instructor] == true
	      @persona = Persona.where(usuario_id: session[:usuario_id]).take
	      @nombre = session[:nombre_usuario]
	      @planformacion = Planformacion.where(instructor_id: session[:usuario_id]).take
	      #@tutor = Persona.where(usuario_id: @adecuacion.tutor_id).take.nombres
	      @informes = Informe.where(planformacion_id: @planformacion)
---
SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 49 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`instructor_id` = 49 LIMIT 1
SELECT  `informe`.* FROM `informe` WHERE `informe`.`planformacion_id` = 15 LIMIT 1

def vista_previa1
  if !session[:informe_id].blank?
 	#Obtener todos los datos importantes de la base de datos
    @informe= Informe.find(session[:informe_id])
    @TipoSemestre=TipoInforme.where(id: @informe.tipo_id).take
    @fechaActual = Date.current.to_s
    @plan= Planformacion.find(session[:plan_id])
    @fechaConcurso = @plan.fecha_inicio
    @usere= Usuarioentidad.where(usuario_id: @plan.instructor_id).take
    @escuela= Escuela.find(@usere.escuela_id)
    @adecuacion= Adecuacion.where(planformacion_id: @plan.id).take
    @adscripcion_docencia= @plan.adscripcion_docencia
    @adscripcion_investigacion= @plan.adscripcion_investigacion
    @persona= Persona.where(usuario_id: @plan.instructor_id).take
    @cpinstruccion = @persona.grado_instruccion
    @user = Usuario.find(@plan.instructor_id)
---
SELECT  `tipo_informe`.* FROM `tipo_informe` WHERE `tipo_informe`.`id` = 1 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 15 LIMIT 1
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 39 LIMIT 1
SELECT  `escuela`.* FROM `escuela` WHERE `escuela`.`id` = 2 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 15 LIMIT 1
SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 39 LIMIT 1
SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 39 LIMIT 1

    @actividades1for= []
    @actividades1otr= []

    @actividades1= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 1).all
    @actividades1.each do |actade|
---
SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 19 AND `adecuacion_actividad`.`semestre` = 1
SELECT  `actividad`.* FROM `actividad` WHERE `actividad`.`id` = 619 LIMIT 1
SELECT  `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`actividad_id` = 620 LIMIT 1

      else
        if tipo==2
          if @informe.numero == 1
            @resActi= InformeActividad.where(informe_id: @informe.id, actividad_id: @act.id).take
            @res= Resultado.where(informe_actividad_id: @resActi.id).all
---
SELECT  `informe_actividad`.* FROM `informe_actividad` WHERE `informe_actividad`.`informe_id` = 60 AND `informe_actividad`.`actividad_id` = 619 LIMIT 1
SELECT `resultado`.* FROM `resultado` WHERE `resultado`.`informe_actividad_id` = 500

    end

    @bool_enviado = 0
    estatus_informe = EstatusInforme.where(informe_id: @informe.id, actual: 1).take
---
SELECT  `estatus_informe`.* FROM `estatus_informe` WHERE `estatus_informe`.`informe_id` = 60 AND `estatus_informe`.`actual` = 1 LIMIT 1

          end
        end
      end
      @ae= ActividadEjecutada.where(informe_actividad_id: actade.id).take
      @actividadese.push(@ae)
      @obs= ObservacionTutor.where(informe_actividad_id: actade.id).take
---
SELECT  `actividad_ejecutada`.* FROM `actividad_ejecutada` WHERE `actividad_ejecutada`.`informe_actividad_id` = 500 LIMIT 1
SELECT  `observacion_tutor`.* FROM `observacion_tutor` WHERE `observacion_tutor`.`informe_actividad_id` = 500 LIMIT 1

	def listar_informes
	    if session[:usuario_id] && session[:instructor] == true

	      @nombre = session[:nombre_usuario]
	      @planformacion = Planformacion.where(instructor_id: session[:usuario_id]).take
        @informes = Informe.where(planformacion_id: @planformacion).order(fecha_modificacion: :desc)
        @status = []
	      session[:informe_id] = nil
	      @tipos= []
	      @informes.each do |inf|
	          si = EstatusInforme.where(informe_id: inf.id, actual: 1).take
---
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`instructor_id` = 49 LIMIT 1
SELECT  `informe`.* FROM `informe` WHERE `informe`.`planformacion_id` = 15 LIMIT 1
SELECT  `estatus_informe`.* FROM `estatus_informe` WHERE `estatus_informe`.`informe_id` = 60 AND `estatus_informe`.`actual` = 1 LIMIT 1

	def ver_detalles_adecuacion
		if session[:usuario_id] && session[:instructor] == true

			@plan_formacion = Planformacion.where(instructor_id: session[:usuario_id]).take
			@adecuacion = Adecuacion.where(planformacion_id: @plan_formacion).take
			@status_adecuacion = EstatusAdecuacion.where(adecuacion_id: @adecuacion.id, actual: 1).take
			@tipo_status = TipoEstatus.where(id: @status_adecuacion.estatus_id, ).take.concepto



			@nombre = session[:nombre_usuario]
			@instructorName = session[:nombre_usuario]
			@modifique=false
      		session[:informe_id] = nil
			@cant_delete= params[:cant_delete]
			@cant_edit= params[:cant_edit]
			@cant_doc= params[:cant_docencia]
			@cant_inv= params[:cant_investigacion]
			@cant_for= params[:cant_formacion]
			@cant_ext= params[:cant_extension]
			@cant_otr= params[:cant_otra]
			semestre= params[:semestre].to_i

			#if params[:adecuacion_id]!=nil
				session[:adecuacion_id]= @adecuacion.id
			#end

      		@tutoresAnteriores = Instructortutor.where(instructor_id: session[:usuario_id], actual: 0)
			@adecuacion= Adecuacion.find(session[:adecuacion_id])
			@plan = Planformacion.where(instructor_id: session[:usuario_id]).take
			@userentidad= Usuarioentidad.where(usuario_id: session[:usuario_id]).take
			@entidad= Entidad.find(@userentidad.entidad_id)
			@escuela= Escuela.where(id: @userentidad.escuela_id).take
			@tutor = Persona.where(usuario_id: @adecuacion.tutor_id).take
      @usuario = Usuario.where(id: session[:usuario_id]).take
---
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`instructor_id` = 49 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 15 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`id` = 19 LIMIT 1
SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 19 AND `estatus_adecuacion`.`actual` = 1 LIMIT 1
SELECT  `tipo_estatus`.* FROM `tipo_estatus` WHERE `tipo_estatus`.`id` = 1 LIMIT 1
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 49 LIMIT 1
SELECT  `entidad`.* FROM `entidad` WHERE `entidad`.`id` = 19 LIMIT 1
SELECT  `escuela`.* FROM `escuela` WHERE `escuela`.`id` = 2 LIMIT 1
SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 48 LIMIT 1
SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 49 LIMIT 1

  def detalles_adecuacion2

    if session[:usuario_id] && session[:instructor]
			if params[:plan_id]
			    @planformacion = Planformacion.find(params[:plan_id])
			    session[:plan_id] = @planformacion.id
			    @adecuacion = Adecuacion.where(planformacion_id: session[:plan_id]).take
			    session[:adecuacion_id]= @adecuacion.id
			else
			    @planformacion = Planformacion.find(session[:plan_id])
			end
			if !@planformacion.blank?
			#Ver si el informe fue rachazado
			cpInstructor = Usuario.find(@planformacion.instructor_id)
			if (cpInstructor.activo == false)
				@cpBloquear = true
			else
				@cpBloquear = false
			end
			#fin
		end

		@adecuacion = Adecuacion.where(planformacion_id: session[:plan_id]).take
		if params[:editar] == 'no'
			session[:editar]= false
		end
		@est= EstatusAdecuacion.where(adecuacion_id: @adecuacion.id, actual: 1).take
---
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 15 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 15 LIMIT 1
SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 39 LIMIT 1
SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 19 AND `estatus_adecuacion`.`actual` = 1 LIMIT 1

		@actividadesaotr= []
		@observacionesExtras= []
		@j=0
		@actividadesa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 0).all
		@actividadesa.each do |actade|
---
SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 19 AND `adecuacion_actividad`.`semestre` = 0
SELECT  `actividad`.* FROM `actividad` WHERE `actividad`.`id` = 625 LIMIT 1

		end
		@actividadesa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 0).all
		@actividadesa.each do |actade|
			@cpObs= ObservacionActividadAdecuacion.where(adecuacionactividad_id: actade.id).all
---
SELECT `observacion_actividad_adecuacion`.* FROM `observacion_actividad_adecuacion` WHERE `observacion_actividad_adecuacion`.`adecuacionactividad_id` = 460

	def detalles_adecuacion3
		if session[:usuario_id] && session[:instructor] == true
      session[:informe_id] = nil
			@iddoc= 'id_docencia'
			@docencia='docencia'
			@investigacion= 'investigacion'
			@formacion= 'formacion'
			@extension= 'extension'
			@otra= 'otra'
			@nombre = session[:nombre_usuario]
			@instructorName = session[:instructorName]
			@adecuacion= Adecuacion.find(session[:adecuacion_id])
			@plan = Planformacion.where(instructor_id: session[:usuario_id]).take
			@actividadesadoc= []
			@actividadesainv= []
			@actividadesaext= []
			@actividadesafor= []
			@actividadesaotr= []
      @observacionesExtras= []
			@actividadesa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 1).all
---
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`id` = 19 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`instructor_id` = 49 LIMIT 1
SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 19 AND `adecuacion_actividad`.`semestre` = 1

	def detalles_adecuacion4
		if session[:usuario_id] && session[:instructor] == true
			@iddoc= 'id_docencia'
      session[:informe_id] = nil
			@docencia='docencia'
			@investigacion= 'investigacion'
			@formacion= 'formacion'
			@extension= 'extension'
			@otra= 'otra'
			@nombre = session[:nombre_usuario]
			@instructorName = session[:instructorName]
			@adecuacion= Adecuacion.find(session[:adecuacion_id])
			@plan = Planformacion.where(instructor_id: session[:usuario_id]).take
			@actividadesadoc= []
			@actividadesainv= []
			@actividadesaext= []
			@actividadesafor= []
			@actividadesaotr= []
      @observacionesExtras= []
			@actividadesa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 2).all
---
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`id` = 19 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`instructor_id` = 49 LIMIT 1
SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 19 AND `adecuacion_actividad`.`semestre` = 2

	def detalles_adecuacion5
		if session[:usuario_id] && session[:instructor] == true
      session[:informe_id] = nil
			@iddoc= 'id_docencia'
			@docencia='docencia'
			@investigacion= 'investigacion'
			@formacion= 'formacion'
			@extension= 'extension'
			@otra= 'otra'
			@nombre = session[:nombre_usuario]
			@instructorName = session[:instructorName]
			@adecuacion= Adecuacion.find(session[:adecuacion_id])
			@plan = Planformacion.where(instructor_id: session[:usuario_id]).take
			@actividadesadoc= []
			@actividadesainv= []
			@actividadesaext= []
			@actividadesafor= []
			@actividadesaotr= []
      @observacionesExtras= []
			@actividadesa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 3).all
---
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`id` = 19 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`instructor_id` = 49 LIMIT 1
SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 19 AND `adecuacion_actividad`.`semestre` = 3

	def detalles_adecuacion6
		if session[:usuario_id] && session[:instructor] == true
      session[:informe_id] = nil
			@iddoc= 'id_docencia'
			@docencia='docencia'
			@investigacion= 'investigacion'
			@formacion= 'formacion'
			@extension= 'extension'
			@otra= 'otra'
			@nombre = session[:nombre_usuario]
			@instructorName = session[:instructorName]
			@adecuacion= Adecuacion.find(session[:adecuacion_id])
			@plan = Planformacion.where(instructor_id: session[:usuario_id]).take
			@actividadesadoc= []
			@actividadesainv= []
			@actividadesaext= []
			@actividadesafor= []
			@actividadesaotr= []
      @observacionesExtras= []
			@actividadesa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 4).all
---
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`id` = 19 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`instructor_id` = 49 LIMIT 1
SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 19 AND `adecuacion_actividad`.`semestre` = 4

  def detalles_adecuacion7
    if session[:usuario_id] && session[:instructor] == true
      session[:informe_id] = nil
      @iddoc= 'id_docencia'
      @docencia='docencia'
      @investigacion= 'investigacion'
      @formacion= 'formacion'
      @extension= 'extension'
      @otra= 'otra'
      @nombre = session[:nombre_usuario]
      @instructorName = session[:instructorName]
      @adecuacion= Adecuacion.find(session[:adecuacion_id])
      @plan = Planformacion.where(instructor_id: session[:usuario_id]).take
      @actividadesadoc= []
      @actividadesainv= []
      @actividadesaext= []
      @actividadesafor= []
      @actividadesaotr= []
      @observacionesExtras= []
      @actividadesa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 5).all
---
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`id` = 19 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`instructor_id` = 49 LIMIT 1
SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 19 AND `adecuacion_actividad`.`semestre` = 5

	def vista_previa
		@fechaActual = Date.current.to_s
    session[:informe_id] = nil
		@plan= Planformacion.where(instructor_id: session[:usuario_id]).take
		@usere= Usuarioentidad.where(usuario_id: @plan.instructor_id).take
		@fechaConcurso = @plan.fecha_inicio
		@escuela= Escuela.find(@usere.escuela_id)
		@adecuacion= Adecuacion.where(planformacion_id: @plan.id).take
		@adscripcion_docencia= @plan.adscripcion_docencia
		@adscripcion_investigacion= @plan.adscripcion_investigacion
		@persona= Persona.where(usuario_id: @plan.instructor_id).take
		@cpinstruccion = @persona.grado_instruccion
		@user = Usuario.find(@plan.instructor_id)
    @cpTutor= Persona.where(usuario_id: @plan.tutor_id).take
    @cpTutorEmail= Usuario.find(@plan.tutor_id).email

		@docencia='docencia'
		@investigacion= 'investigacion'
		@formacion= 'formacion'
		@extension= 'extension'
		@obligatoria= 'obligatoria'
		@otra= 'otra'

		@nombre = session[:nombre_usuario]
		@instructorName = session[:instructorName]
    actividades = AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 0)
      if !actividades.blank?
---
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`instructor_id` = 39 LIMIT 1
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 39 LIMIT 1
SELECT  `escuela`.* FROM `escuela` WHERE `escuela`.`id` = 2 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 15 LIMIT 1
SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 39 LIMIT 1
SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 39 LIMIT 1
SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 19 AND `adecuacion_actividad`.`semestre` = 0
SELECT  `actividad`.* FROM `actividad` WHERE `actividad`.`id` = 573 LIMIT 1

	def ver_detalles_informe
	    if session[:usuario_id] && session[:instructor] == true
	      @nombre = session[:nombre_usuario]
	      if not @nombre
	        print "NO HAY USUARIO"
	      end
	      @persona = Persona.where(usuario_id: session[:usuario_id]).take
	      if session[:plan_id]
	        @planformacion = Planformacion.where(instructor_id: session[:usuario_id]).take
	      else
	        @planformacion = Planformacion.where(instructor_id: session[:usuario_id]).take
          session[:plan_id] = @planformacion.id
	      end
	      if params[:informe_id]!=nil
	        session[:informe_id]= params[:informe_id]
	      end
        if !session[:informe_id].blank?
  		    @tutor = Persona.where(usuario_id: @planformacion.tutor_id).take
  	      @instructor = Persona.where(usuario_id: @planformacion.instructor_id).take

  	      if session[:informe_id] == nil
  	      	session[:informe_id] = params[:informe_id]
  	      	@informe= Informe.find(session[:informe_id])
---
SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 39 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`instructor_id` = 39 LIMIT 1
SELECT  `informe`.* FROM `informe` WHERE `informe`.`id` = 60 LIMIT 1

  	        end
  	      end

  	      @estatus= EstatusInforme.where(informe_id: @informe.id).take
  	      @status= TipoEstatus.find(@estatus.estatus_id)
  	      @userentidad= Usuarioentidad.where(usuario_id: @planformacion.instructor_id).take
  	      @entidad= Entidad.find(@userentidad.entidad_id)
  	      @escuela= Escuela.find(@userentidad.escuela_id)
---
SELECT  `estatus_informe`.* FROM `estatus_informe` WHERE `estatus_informe`.`informe_id` = 60 LIMIT 1
SELECT  `tipo_estatus`.* FROM `tipo_estatus` WHERE `tipo_estatus`.`id` = 6 LIMIT 1
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 39 LIMIT 1
SELECT  `entidad`.* FROM `entidad` WHERE `entidad`.`id` = 19 LIMIT 1
SELECT  `escuela`.* FROM `escuela` WHERE `escuela`.`id` = 2 LIMIT 1

	def detalles_informe2
    if !session[:informe_id].blank?
      @nombre = session[:nombre_usuario]
      @CJagregado = ["no","no","no","no"]
        if not @nombre
          print "NO HAY USUARIO"
        end
      @informe= Informe.find(session[:informe_id])
      @est= EstatusInforme.where(informe_id: @informe.id).take
      @modificar= false
      if @est.estatus_id == 6
        @modificar=true
      end
      @docencia= "docencia"
      @j= 0
      @k=0
      @actividadesa= InformeActividad.where(informe_id: @informe.id).all
---
SELECT  `informe`.* FROM `informe` WHERE `informe`.`id` = 60 LIMIT 1
SELECT  `estatus_informe`.* FROM `estatus_informe` WHERE `estatus_informe`.`informe_id` = 60 LIMIT 1
SELECT  `informe_actividad`.* FROM `informe_actividad` WHERE `informe_actividad`.`actividad_id` = 620 AND `informe_actividad`.`informe_id` = 60 LIMIT 1

          if @resultados2b != []
            @resultados2b= Array.new(0) { |i|  }
          end
          @res= Resultado.where(informe_actividad_id: actade.id).all
---
SELECT `resultado`.* FROM `resultado` WHERE `resultado`.`informe_actividad_id` = 500

          end
          @resultados2a.push(@resultados2b)
        else
          @act= Actividad.find(actade.actividad_id)
---
SELECT  `actividad`.* FROM `actividad` WHERE `actividad`.`id` = 620 LIMIT 1

            end
          end
          @resultados2a.push(@resultados2b)
          @ae= ActividadEjecutada.where(informe_actividad_id: actade.id).take
          @actividadese.push(@ae)
          @obs= ObservacionTutor.where(informe_actividad_id: actade.id).take
---
SELECT  `actividad_ejecutada`.* FROM `actividad_ejecutada` WHERE `actividad_ejecutada`.`informe_actividad_id` = 500 LIMIT 1
SELECT  `observacion_tutor`.* FROM `observacion_tutor` WHERE `observacion_tutor`.`informe_actividad_id` = 500 LIMIT 1

          else
            @observaciont.push(@obs.observaciones)
          end
          semestre = AdecuacionActividad.where(actividad_id: @act.id).take.semestre
---
SELECT  `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`actividad_id` = 620 LIMIT 1

  def mas_observaciones3 #mas obs de actividades del informe

    @adecuacion= Adecuacion.find(session[:adecuacion_id])
---
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`id` = NULL LIMIT 1