forminst_new1/app/controllers/inicioentidad_controller.rb

SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 3 LIMIT 1
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 37 LIMIT 1
SELECT `notificacion`.* FROM `notificacion` WHERE `notificacion`.`actual` = 3
---
	def index
		if session[:usuario_id] && session[:entidad] == true
			session[:adecuacion_id] = nil
			session[:plan_id] = nil
			session[:instructorName] = nil
			session[:informe_id]=nil
			@usuarioAux=Usuario.find(session[:usuario_id])
			@cjpTipo=@usuarioAux.tipo
			@nombre = session[:nombre_usuario]
			@usu=Usuarioentidad.where(usuario_id: @usuarioAux.id).take
			@entidad_escuela_id= @usu.escuela_id
			@notificaciones1= []
			puts @usu.departamento_id
			puts "aaaaaaaaaaaaaaaaaaaaaaaaaaa"
			puts @entidad_escuela_id
			if (session[:entidad_id] >= 7 && session[:entidad_id] <= 12)#Caso de Comision de Investigación
				if(@entidad_escuela_id == 1)
					@notificaciones = Notificacion.where(actual: 3, departamento_id: @usu.departamento_id).all

SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 3 LIMIT 1
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 3 LIMIT 1
SELECT `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`actual` = 1 AND `estatus_adecuacion`.`estatus_id` IN (3, 2, 8, 4, 1, 5, 9)
---
	def listar_adecuaciones
		if session[:usuario_id] && session[:entidad]== true
			session[:informe_id]=nil
			@cjpTipo=Usuario.find(session[:usuario_id]).tipo
			session[:adecuacion_id]=nil
				@nombre = session[:nombre_usuario]
				@usu=Usuarioentidad.where(usuario_id: session[:usuario_id]).take
				@entidad_escuela_id= @usu.escuela_id
				@entidad_departamento= @usu.departamento_id
				@adecuaciones = []
				@status = []
				@nombre_tutor = []
				@nombre_instructor = []
			if (session[:entidad_id] >= 7 && session[:entidad_id] <= 12)
			#Usuario comision
				@status_inv = EstatusAdecuacion.where(actual: 1,  estatus_id: [3,2,8,4,1,5,9]) #Estatus enviado a comision de investigacion

SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`id` = 1 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 1 LIMIT 1
---

			@status_inv.each do |si|

				@adec= Adecuacion.find(si.adecuacion_id)
				@pf = Planformacion.find(@adec.planformacion_id)

SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 37 LIMIT 1
---
						@st = "RECHAZADO POR CONSEJO DE FACULTAD"
					end
					@status.push(@st)
					@nombre_tutor.push(Persona.where(usuario_id: @pf.tutor_id).take.nombres)

SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 1 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 15 LIMIT 1
SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 3 LIMIT 1
SELECT `document`.* FROM `document` WHERE `document`.`adecuacion_id` = 19 AND `document`.`informe_id` = 58 AND `document`.`actividad_id` = 561
SELECT  `estatus_informe`.* FROM `estatus_informe` WHERE `estatus_informe`.`informe_id` = 58 AND `estatus_informe`.`actual` = 1 LIMIT 1
---
def ver_soporte
    @plan = Planformacion.where(id: session[:plan_id]).take
    @adecuacion = Adecuacion.where(planformacion_id: session[:plan_id]).take
    @documents = []
	@cjpTipo=Usuario.find(session[:usuario_id]).tipo
    if !session[:informe_id].blank?
    	$actividad = params[:actividad_id].to_i
    	adec = Adecuacion.where(planformacion_id: session[:plan_id]).take
    	session[:adecuacion_id] = adec.id
      	@documents = Document.where(adecuacion_id: session[:adecuacion_id], informe_id: session[:informe_id], actividad_id: $actividad).all
		@bool_enviado = 0
		if (session[:entidad_id] >= 7 && session[:entidad_id] <= 12)
		#Usuario comision
			estatusI = EstatusInforme.where(informe_id: session[:informe_id], actual: 1).take #Estatus enviado a comision de investigacioni

SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 1 AND `estatus_adecuacion`.`actual` = 1 LIMIT 1
---
		@bool_enviado = 0
		if (session[:entidad_id] >= 7 && session[:entidad_id] <= 12)
		#Usuario comision
			estatusI = EstatusAdecuacion.where(adecuacion_id: session[:adecuacion_id], actual: 1).take #Estatus enviado a comision de investigacioni

SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 3 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`id` = 1 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 1 LIMIT 1
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 38 LIMIT 1
SELECT  `escuela`.* FROM `escuela` WHERE `escuela`.`id` = 2 LIMIT 1
SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 38 LIMIT 1
---
	def ver_detalles_adecuacion
		if session[:usuario_id] && session[:entidad] == true
			if (!session[:adecuacion_id].blank? || !params[:adecuacion_id].blank?)
				@cjpTipo=Usuario.find(session[:usuario_id]).tipo
				@nombre = session[:nombre_usuario]
				@modifique=false
				session[:informe_id] = nil
				@cant_delete= params[:cant_delete]
				@cant_edit= params[:cant_edit]
				@cant_doc= params[:cant_docencia]
				@cant_inv= params[:cant_investigacion]
				@cant_for= params[:cant_formacion]
				@cant_ext= params[:cant_extension]
				@cant_otr= params[:cant_otra]
				semestre= params[:semestre].to_i

				if params[:adecuacion_id]!=nil
					session[:adecuacion_id]= params[:adecuacion_id]
				end

				@tutoresAnteriores = Instructortutor.where(instructor_id: session[:usuario_id], actual: 0)
				@adecuacion= Adecuacion.find(session[:adecuacion_id])
				@plan= Planformacion.find(@adecuacion.planformacion_id)
				session[:plan_id] = @plan.id
				@userentidad= Usuarioentidad.where(usuario_id: @plan.instructor_id).take
				if @userentidad.escuela_id == nil
					@userentidad.escuela_id=12
					@userentidad.save
					@escuela= Escuela.where(id: @userentidad.escuela_id).take
				else
					@escuela= Escuela.where(id: @userentidad.escuela_id).take
				end
				@instructor= Persona.where(usuario_id: @plan.instructor_id).take

SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 1 AND `estatus_adecuacion`.`actual` = 1 LIMIT 1
---
				@bool_enviado = 0
				if (session[:entidad_id] >= 7 && session[:entidad_id] <= 12)
				#Usuario comision
					estatusI = EstatusAdecuacion.where(adecuacion_id: @adecuacion.id, actual: 1).take #Estatus enviado a comision de investigacioni

SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 3 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`id` = 1 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 1 LIMIT 1
SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 1 LIMIT 1
SELECT  `revision`.* FROM `revision` WHERE `revision`.`usuario_id` = 3 AND `revision`.`adecuacion_id` = 1 AND `revision`.`estatus_id` = 6 AND `revision`.`informe_id` IS NULL LIMIT 1
SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 1 AND `adecuacion_actividad`.`semestre` = 1
SELECT  `actividad`.* FROM `actividad` WHERE `actividad`.`id` = 1 LIMIT 1
---
	def detalles_adecuacion3
		if session[:usuario_id] && session[:entidad] == true
			if !session[:adecuacion_id].blank?
				@cjpTipo=Usuario.find(session[:usuario_id]).tipo
				@semestre = 1
				@iddoc= 'id_docencia'
				@docencia='docencia'
				@investigacion= 'investigacion'
				session[:informe_id] = nil
				@formacion= 'formacion'
				@extension= 'extension'
				@otra= 'otra'
				@nombre = session[:nombre_usuario]
				@adecuacion= Adecuacion.find(session[:adecuacion_id])

				@plan= Planformacion.find(@adecuacion.planformacion_id)
				@actividadesadoc= []
				@actividadesainv= []
				@actividadesaext= []
				@actividadesafor= []
				@actividadesaotr= []
				@observaciont= []
				@observacionesExtras= []
				@j=0
				@est= EstatusAdecuacion.where(adecuacion_id: @adecuacion.id).take
				@revision= Revision.where(usuario_id: session[:usuario_id], adecuacion_id: @adecuacion.id, estatus_id: @est.estatus_id, informe_id: nil).take
				@actividadesa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 1).all
				@actividadesa.each do |actade|

SELECT  `observacion_actividad_adecuacion`.* FROM `observacion_actividad_adecuacion` WHERE `observacion_actividad_adecuacion`.`adecuacionactividad_id` = 1 AND `observacion_actividad_adecuacion`.`revision_id` = 1 LIMIT 1
---

					if(@revision!=nil && @revision != "")

						@obs= ObservacionActividadAdecuacion.where(adecuacionactividad_id: actade.id, revision_id: @revision.id).take

SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 1 AND `estatus_adecuacion`.`actual` = 1 LIMIT 1
---
				@bool_enviado = 0
				if (session[:entidad_id] >= 7 && session[:entidad_id] <= 12)
				#Usuario comision
					estatusI = EstatusAdecuacion.where(adecuacion_id: @adecuacion.id, actual: 1).take #Estatus enviado a comision de investigacioni

SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 3 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`id` = 1 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 1 LIMIT 1
SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 1 LIMIT 1
SELECT  `revision`.* FROM `revision` WHERE `revision`.`usuario_id` = 3 AND `revision`.`adecuacion_id` = 1 AND `revision`.`estatus_id` = 6 AND `revision`.`informe_id` IS NULL LIMIT 1
SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 1 AND `adecuacion_actividad`.`semestre` = 2
SELECT  `actividad`.* FROM `actividad` WHERE `actividad`.`id` = 6 LIMIT 1
---
	def detalles_adecuacion4
		if session[:usuario_id] && session[:entidad] == true
			if !session[:adecuacion_id].blank?
				@cjpTipo=Usuario.find(session[:usuario_id]).tipo
				@semestre = 2
				@iddoc= 'id_docencia'
				session[:informe_id] = nil
				@docencia='docencia'
				@investigacion= 'investigacion'
				@formacion= 'formacion'
				@extension= 'extension'
				@otra= 'otra'
				@nombre = session[:nombre_usuario]
				@adecuacion= Adecuacion.find(session[:adecuacion_id])

				@plan= Planformacion.find(@adecuacion.planformacion_id)
				@actividadesadoc= []
				@actividadesainv= []
				@actividadesaext= []
				@actividadesafor= []
				@actividadesaotr= []
				@observaciont= []
				@observacionesExtras= []
				@j=0
				@est= EstatusAdecuacion.where(adecuacion_id: @adecuacion.id).take
				@revision= Revision.where(usuario_id: session[:usuario_id], adecuacion_id: @adecuacion.id, estatus_id: @est.estatus_id, informe_id: nil).take
				@actividadesa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 2).all
				@actividadesa.each do |actade|

SELECT  `observacion_actividad_adecuacion`.* FROM `observacion_actividad_adecuacion` WHERE `observacion_actividad_adecuacion`.`adecuacionactividad_id` = 6 AND `observacion_actividad_adecuacion`.`revision_id` = 1 LIMIT 1
---

					if(@revision!=nil && @revision != "")

						@obs= ObservacionActividadAdecuacion.where(adecuacionactividad_id: actade.id, revision_id: @revision.id).take

SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 1 AND `estatus_adecuacion`.`actual` = 1 LIMIT 1
---
				@bool_enviado = 0
				if (session[:entidad_id] >= 7 && session[:entidad_id] <= 12)
				#Usuario comision
					estatusI = EstatusAdecuacion.where(adecuacion_id: @adecuacion.id, actual: 1).take #Estatus enviado a comision de investigacioni

SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 3 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`id` = 19 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 15 LIMIT 1
SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 19 LIMIT 1
SELECT  `revision`.* FROM `revision` WHERE `revision`.`usuario_id` = 3 AND `revision`.`adecuacion_id` = 19 AND `revision`.`estatus_id` = 6 AND `revision`.`informe_id` IS NULL LIMIT 1
SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 19 AND `adecuacion_actividad`.`semestre` = 3
SELECT  `actividad`.* FROM `actividad` WHERE `actividad`.`id` = 572 LIMIT 1
---
	def detalles_adecuacion5
		if session[:usuario_id] && session[:entidad] == true
			if !session[:adecuacion_id].blank?
				@cjpTipo=Usuario.find(session[:usuario_id]).tipo
				@semestre = 3
				@iddoc= 'id_docencia'
				@docencia='docencia'
				@investigacion= 'investigacion'
				session[:informe_id] = nil
				@formacion= 'formacion'
				@extension= 'extension'
				@otra= 'otra'
				@nombre = session[:nombre_usuario]
				@adecuacion= Adecuacion.find(session[:adecuacion_id])

				@plan= Planformacion.find(@adecuacion.planformacion_id)
				@actividadesadoc= []
				@actividadesainv= []
				@actividadesaext= []
				@actividadesafor= []
				@actividadesaotr= []
				@observaciont= []
				@observacionesExtras= []
				@j=0
				@est= EstatusAdecuacion.where(adecuacion_id: @adecuacion.id).take
				@revision= Revision.where(usuario_id: session[:usuario_id], adecuacion_id: @adecuacion.id, estatus_id: @est.estatus_id, informe_id: nil).take
				@actividadesa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 3).all
				@actividadesa.each do |actade|

SELECT `observacion_actividad_adecuacion`.* FROM `observacion_actividad_adecuacion` WHERE `observacion_actividad_adecuacion`.`adecuacionactividad_id` = 410
---

					if(@revision!=nil && @revision != "")

						@obs= ObservacionActividadAdecuacion.where(adecuacionactividad_id: actade.id, revision_id: @revision.id).take

SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 19 AND `estatus_adecuacion`.`actual` = 1 LIMIT 1
---
				@bool_enviado = 0
				if (session[:entidad_id] >= 7 && session[:entidad_id] <= 12)
				#Usuario comision
					estatusI = EstatusAdecuacion.where(adecuacion_id: @adecuacion.id, actual: 1).take #Estatus enviado a comision de investigacioni

SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 3 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`id` = 1 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 1 LIMIT 1
SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 1 LIMIT 1
SELECT  `revision`.* FROM `revision` WHERE `revision`.`usuario_id` = 3 AND `revision`.`adecuacion_id` = 1 AND `revision`.`estatus_id` = 6 AND `revision`.`informe_id` IS NULL LIMIT 1
SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 1 AND `adecuacion_actividad`.`semestre` = 4
SELECT  `actividad`.* FROM `actividad` WHERE `actividad`.`id` = 16 LIMIT 1
---
	def detalles_adecuacion6
		if session[:usuario_id] && session[:entidad] == true
			if !session[:adecuacion_id].blank?
				@cjpTipo=Usuario.find(session[:usuario_id]).tipo
				@semestre = 4
				@iddoc= 'id_docencia'
				session[:informe_id] = nil
				@docencia='docencia'
				@investigacion= 'investigacion'
				@formacion= 'formacion'
				@extension= 'extension'
				@otra= 'otra'
				@nombre = session[:nombre_usuario]
				@adecuacion= Adecuacion.find(session[:adecuacion_id])

				@plan= Planformacion.find(@adecuacion.planformacion_id)
				@actividadesadoc= []
				@actividadesainv= []
				@actividadesaext= []
				@actividadesafor= []
				@actividadesaotr= []
				@observaciont= []
				@observacionesExtras= []
				@j=0
				@est= EstatusAdecuacion.where(adecuacion_id: @adecuacion.id).take
				@revision= Revision.where(usuario_id: session[:usuario_id], adecuacion_id: @adecuacion.id, estatus_id: @est.estatus_id, informe_id: nil).take
				@actividadesa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 4).all
				@actividadesa.each do |actade|

SELECT  `observacion_actividad_adecuacion`.* FROM `observacion_actividad_adecuacion` WHERE `observacion_actividad_adecuacion`.`adecuacionactividad_id` = 16 AND `observacion_actividad_adecuacion`.`revision_id` = 1 LIMIT 1
---

					if(@revision!=nil && @revision != "")

						@obs= ObservacionActividadAdecuacion.where(adecuacionactividad_id: actade.id, revision_id: @revision.id).take

SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 1 AND `estatus_adecuacion`.`actual` = 1 LIMIT 1
---
				@bool_enviado = 0
				if (session[:entidad_id] >= 7 && session[:entidad_id] <= 12)
				#Usuario comision
					estatusI = EstatusAdecuacion.where(adecuacion_id: @adecuacion.id, actual: 1).take #Estatus enviado a comision de investigacioni

SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 3 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`id` = 1 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 1 LIMIT 1
SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 1 LIMIT 1
SELECT  `revision`.* FROM `revision` WHERE `revision`.`usuario_id` = 3 AND `revision`.`adecuacion_id` = 1 AND `revision`.`estatus_id` = 6 AND `revision`.`informe_id` IS NULL LIMIT 1
SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 1 AND `adecuacion_actividad`.`semestre` = 5
SELECT  `actividad`.* FROM `actividad` WHERE `actividad`.`id` = 584 LIMIT 1
---
	def detalles_adecuacion7
		if session[:usuario_id] && session[:entidad]== true
			if !session[:adecuacion_id].blank?
				@cjpTipo=Usuario.find(session[:usuario_id]).tipo
				@semestre = 5
				@iddoc= 'id_docencia'
				session[:informe_id] = nil
				@docencia='docencia'
				@investigacion= 'investigacion'
				@formacion= 'formacion'
				@extension= 'extension'
				@otra= 'otra'
				@nombre = session[:nombre_usuario]
				@adecuacion= Adecuacion.find(session[:adecuacion_id])

				@plan= Planformacion.find(@adecuacion.planformacion_id)
				@actividadesadoc= []
				@actividadesainv= []
				@actividadesaext= []
				@actividadesafor= []
				@observaciont= []
				@observacionesExtras= []
				@j=0
				@est= EstatusAdecuacion.where(adecuacion_id: @adecuacion.id).take
				@revision= Revision.where(usuario_id: session[:usuario_id], adecuacion_id: @adecuacion.id, estatus_id: @est.estatus_id, informe_id: nil).take
				@actividadesa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 5).all
				@actividadesa.each do |actade|

SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 1 AND `estatus_adecuacion`.`actual` = 1 LIMIT 1
---
				@bool_enviado = 0
				if (session[:entidad_id] >= 7 && session[:entidad_id] <= 12)
				#Usuario comision
					estatusI = EstatusAdecuacion.where(adecuacion_id: @adecuacion.id, actual: 1).take #Estatus enviado a comision de investigacioni

SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 3 LIMIT 1
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 3 LIMIT 1
SELECT `estatus_informe`.* FROM `estatus_informe` WHERE `estatus_informe`.`actual` = 1 AND `estatus_informe`.`estatus_id` IN (3, 2, 8, 4, 1, 5, 9)
SELECT  `informe`.* FROM `informe` WHERE `informe`.`id` = 9 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 1 LIMIT 1
SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 38 LIMIT 1
---
	def listar_informes
	    if session[:usuario_id] && session[:entidad]== true

			@cjpTipo=Usuario.find(session[:usuario_id]).tipo
	    	session[:informe_id]=nil
	    	@nombre = session[:nombre_usuario]
			@usu=Usuarioentidad.where(usuario_id: session[:usuario_id]).take
			@entidad_escuela_id= @usu.escuela_id
			@depto = @usu.departamento_id
			@informes = []
			@tipos= []
			@status = []
			@nombre_tutor = []
			@nombre_instructor = []
			if (session[:entidad_id] >= 7 && session[:entidad_id] <= 12)
			#Usuario comision
				@status_inv = EstatusInforme.where(actual: 1,  estatus_id: [3,2,8,4,1,5,9]) #Estatus enviado a comision de investigacion
			elsif (session[:entidad_id] >= 14 && session[:entidad_id] <= 17)
			#Consejo tecnico
				@status_inv = EstatusInforme.where(actual: 1, estatus_id: [2,8,4,1,5,9]) #Estatus enviado a consejo tecnico
			elsif (session[:entidad_id] >= 1 && session[:entidad_id] <= 6)
			#Consejo de escuela
				@status_inv = EstatusInforme.where(actual: 1, estatus_id: [8,4,1,5,9]) #Estatus enviado a consejo escuela
			elsif (session[:entidad_id] == 13)
			#Consejo de facultad
				@status_inv = EstatusInforme.where(actual: 1, estatus_id: [4,1,5,9]) #Estatus enviado a consejo de facultad
				@entidad_escuela_id=nil
			end
			@status_inv.each do |si|
				@inf= Informe.find(si.informe_id)
				@pf = Planformacion.find(@inf.planformacion_id)
				@ppp = Persona.where(usuario_id: @pf.instructor_id).take.nombres

SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 3 LIMIT 1
SELECT  `informe`.* FROM `informe` WHERE `informe`.`id` = 9 LIMIT 1
SELECT  `estatus_informe`.* FROM `estatus_informe` WHERE `estatus_informe`.`informe_id` = 9 AND `estatus_informe`.`actual` = 1 LIMIT 1
SELECT  `tipo_estatus`.* FROM `tipo_estatus` WHERE `tipo_estatus`.`id` = 3 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 1 LIMIT 1
SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 37 LIMIT 1
---
	def ver_detalles_informe
	    if session[:usuario_id] && session[:entidad] == true
			@cjpTipo=Usuario.find(session[:usuario_id]).tipo
	      	@nombre = session[:nombre_usuario]
	      	if params[:informe_id]!=nil
	        	session[:informe_id]= params[:informe_id]
	      	end
	      	if !session[:informe_id].blank?
		      	@informe= Informe.find(session[:informe_id])
		      	session[:plan_id] = @informe.planformacion_id
		      	@est= EstatusInforme.where(informe_id: @informe.id, actual: 1).take
	    		@status= TipoEstatus.find(@est.estatus_id)
		      	@planformacion = Planformacion.find(@informe.planformacion_id)
		      	@persona = Persona.where(usuario_id: @planformacion.tutor_id).take

SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`entidad_id` = 8 LIMIT 1
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 38 LIMIT 1
SELECT  `escuela`.* FROM `escuela` WHERE `escuela`.`id` = 2 LIMIT 1
---

		      	@estatus= EstatusInforme.where(informe_id: @informe.id, actual: 1).take
		      	@status= TipoEstatus.find(@estatus.estatus_id)
		      	@userentidad=Usuarioentidad.where(entidad_id: session[:entidad_id]).take
		      	@userentidadUsuario=Usuarioentidad.where(usuario_id: @informe.tutor_id).take
				@escuela= Escuela.where(id: @userentidadUsuario.escuela_id).take

SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 3 LIMIT 1
SELECT  `informe`.* FROM `informe` WHERE `informe`.`id` = 9 LIMIT 1
SELECT  `estatus_informe`.* FROM `estatus_informe` WHERE `estatus_informe`.`informe_id` = 9 AND `estatus_informe`.`actual` = 1 LIMIT 1
SELECT  `tipo_estatus`.* FROM `tipo_estatus` WHERE `tipo_estatus`.`id` = 3 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 1 LIMIT 1
SELECT `informe_actividad`.* FROM `informe_actividad` WHERE `informe_actividad`.`informe_id` = 9
---
	def detalles_informe2
		@cjpTipo=Usuario.find(session[:usuario_id]).tipo
		@nombre = session[:nombre_usuario]
		if !session[:informe_id].blank?
	    	@informe= Informe.find(session[:informe_id])
	    	@est= EstatusInforme.where(informe_id: @informe.id, actual: 1).take
	    	@status= TipoEstatus.find(@est.estatus_id)
	    	@adecuacion = Adecuacion.where(planformacion_id: @informe.planformacion_id).take
	    	@modificar= false
	    	if @est.estatus_id == 6
	    	  @modificar=true
	    	end
	    	@docencia= "docencia"
	    	@cp=0
	    	@j= 0
	    	@k=0
	    	@actividadesa= InformeActividad.where(informe_id: @informe.id).all

SELECT  `revision`.* FROM `revision` WHERE `revision`.`informe_id` = 9 AND `revision`.`usuario_id` = 3 AND `revision`.`adecuacion_id` = 1 LIMIT 1
---
	    	@actividadese= []
	    	@observaciont= []
	    	@observacionesExtras = []
	    	@revision= Revision.where(informe_id: @informe.id, usuario_id: session[:usuario_id], adecuacion_id: @adecuacion.id).take

SELECT `resultado`.* FROM `resultado` WHERE `resultado`.`informe_actividad_id` = 41
---
	    			@resultados2b= Array.new(0) { |i|  }
	    		end
		      	if actade.actividad_id == nil #Es el caso que es un resultado no contemplado en el plan de formacion o un avancwe de postgrado
		        	@res= Resultado.where(informe_actividad_id: actade.id).all

SELECT `observacion_actividad_informe`.* FROM `observacion_actividad_informe` WHERE `observacion_actividad_informe`.`informe_actividad_id` = 41
SELECT  `observacion_tutor`.* FROM `observacion_tutor` WHERE `observacion_tutor`.`informe_actividad_id` = 41 LIMIT 1
---
			        	@obs=nil

			        else
			        	@obs= ObservacionActividadInforme.where(informe_actividad_id: actade.id, revision_id: @revision.id).take

			        end
			        @cpObs2= ObservacionTutor.where(informe_actividad_id: actade.id).take

SELECT  `actividad`.* FROM `actividad` WHERE `actividad`.`id` = 6 LIMIT 1
---
			        end

		     	else
			        @act= Actividad.find(actade.actividad_id)

SELECT  `actividad_ejecutada`.* FROM `actividad_ejecutada` WHERE `actividad_ejecutada`.`informe_actividad_id` = 41 LIMIT 1
---
			          	@resultados.push(nil)
			        end
			        @resultados2a.push(@resultados2b)
			        @ae= ActividadEjecutada.where(informe_actividad_id: actade.id).take

SELECT  `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`actividad_id` = 620 LIMIT 1
---
						    end
						end
			        end
			          semestre = AdecuacionActividad.where(actividad_id: @act.id).take.semestre

SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 50 LIMIT 1
SELECT  `tipo_informe`.* FROM `tipo_informe` WHERE `tipo_informe`.`id` = 1 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 15 LIMIT 1
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 49 LIMIT 1
SELECT  `escuela`.* FROM `escuela` WHERE `escuela`.`id` = 2 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 15 LIMIT 1
SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 49 LIMIT 1
---
	def vista_previa1
	  if !session[:informe_id].blank?
		@cjpTipo=Usuario.find(session[:usuario_id]).tipo
	    @informe= Informe.find(session[:informe_id])
	    @TipoSemestre=TipoInforme.where(id: @informe.tipo_id).take
	    @fechaActual = Date.current.to_s
	    @plan= Planformacion.find(session[:plan_id])
	    @fechaConcurso = @plan.fecha_inicio
	    @usere= Usuarioentidad.where(usuario_id: @plan.instructor_id).take
	    @escuela= Escuela.find(@usere.escuela_id)
	    @adecuacion= Adecuacion.where(planformacion_id: @plan.id).take
	    @adscripcion_docencia= @plan.adscripcion_docencia
	    @adscripcion_investigacion= @plan.adscripcion_investigacion
	    @persona= Persona.where(usuario_id: @plan.instructor_id).take

SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 19 AND `adecuacion_actividad`.`semestre` = 1
SELECT  `actividad`.* FROM `actividad` WHERE `actividad`.`id` = 561 LIMIT 1
SELECT  `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`actividad_id` = 620 LIMIT 1
---
	    @actividades1for= []
	    @actividades1otr= []

	    @actividades1= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 1).all
	    @actividades1.each do |actade|

SELECT  `informe_actividad`.* FROM `informe_actividad` WHERE `informe_actividad`.`informe_id` = 58 AND `informe_actividad`.`actividad_id` = 562 LIMIT 1
SELECT `resultado`.* FROM `resultado` WHERE `resultado`.`informe_actividad_id` = 491
---
				@actividades1doc.push(@act)
			elsif tipo==2
				if @informe.numero == 1
					@resActi= InformeActividad.where(informe_id: @informe.id, actividad_id: @act.id).take
					@res= Resultado.where(informe_actividad_id: @resActi.id).all

SELECT  `estatus_informe`.* FROM `estatus_informe` WHERE `estatus_informe`.`informe_id` = 58 AND `estatus_informe`.`actual` = 1 LIMIT 1
---
	    end

	    @bool_enviado = 0
	    estatus_informe = EstatusInforme.where(informe_id: @informe.id, actual: 1).take

SELECT  `actividad_ejecutada`.* FROM `actividad_ejecutada` WHERE `actividad_ejecutada`.`informe_actividad_id` = 490 LIMIT 1
SELECT  `observacion_tutor`.* FROM `observacion_tutor` WHERE `observacion_tutor`.`informe_actividad_id` = 490 LIMIT 1
---
	          end
	        end
	      end
	      @ae= ActividadEjecutada.where(informe_actividad_id: actade.id).take
	      @actividadese.push(@ae)
	      @obs= ObservacionTutor.where(informe_actividad_id: actade.id).take

SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 19 AND `estatus_adecuacion`.`actual` = 1 LIMIT 1
---
	    @bool_enviado = 0
		if (session[:entidad_id] >= 7 && session[:entidad_id] <= 12)
		#Usuario comision
			estatusI = EstatusAdecuacion.where(adecuacion_id: @adecuacion.id, actual: 1).take #Estatus enviado a comision de investigacioni

SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 12 LIMIT 1
SELECT  `informe_actividad`.* FROM `informe_actividad` WHERE `informe_actividad`.`informe_id` = 60 AND `informe_actividad`.`actividad_id` = 620 LIMIT 1
SELECT `observacion_actividad_informe`.* FROM `observacion_actividad_informe` WHERE `observacion_actividad_informe`.`informe_actividad_id` = 500
---
	def mas_observaciones
		@boolobs= 0
		@booltutor = 0
		@informe_id = params[:informe_id].to_i
		@actividad_id = params[:actividad_id].to_i
			@cjpTipo=Usuario.find(session[:usuario_id]).tipo
		ia = InformeActividad.where(informe_id: @informe_id, actividad_id: @actividad_id).take


		@observaciones = ObservacionActividadInforme.where(informe_actividad_id: ia.id).all

SELECT  `observacion_tutor`.* FROM `observacion_tutor` WHERE `observacion_tutor`.`informe_actividad_id` = 500 LIMIT 1
---
			end
		end

		@obs_t= ObservacionTutor.where(informe_actividad_id: ia.id).take

SELECT  `estatus_informe`.* FROM `estatus_informe` WHERE `estatus_informe`.`informe_id` = 60 AND `estatus_informe`.`actual` = 1 LIMIT 1
---
		@bool_enviado = 0
		if (session[:entidad_id] >= 7 && session[:entidad_id] <= 12)
		#Usuario comision
			estatusI = EstatusInforme.where(informe_id: @informe_id, actual: 1).take #Estatus enviado a comision de investigacioni

SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 3 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 1 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 1 LIMIT 1
SELECT `respaldo`.* FROM `respaldo` WHERE `respaldo`.`adecuacion_id` = 19 AND `respaldo`.`informe_id` IS NULL
---
	def ver_respaldos
		if session[:usuario_id] && session[:entidad]
		  @cjpTipo=Usuario.find(session[:usuario_id]).tipo
		  @plan = Planformacion.where(id: session[:plan_id]).take
		  @adec = Adecuacion.where(planformacion_id: session[:plan_id]).take
		  @documents = []
		  if !session[:informe_id].blank?
		    @documents = Respaldo.where(adecuacion_id: @adec.id, informe_id: session[:informe_id]).all

SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`id` = 1 LIMIT 1
SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 3 LIMIT 1
SELECT  `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 1 AND `adecuacion_actividad`.`semestre` = 1 AND `adecuacion_actividad`.`actividad_id` = 1 LIMIT 1
SELECT `observacion_actividad_adecuacion`.* FROM `observacion_actividad_adecuacion` WHERE `observacion_actividad_adecuacion`.`adecuacionactividad_id` = 1
SELECT  `revision`.* FROM `revision` WHERE `revision`.`id` = 1 LIMIT 1
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 3 LIMIT 1
---
 	def mas_observaciones3 #mas obs de actividades del Adecuación
 		@boolobs = 0
 		@adecuacion= Adecuacion.find(session[:adecuacion_id])
		@cjpTipo=Usuario.find(session[:usuario_id]).tipo
 		@semestre = params[:semestre].to_i
 		@actividad_id = params[:actividad_id].to_i

		aa= AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: @semestre, actividad_id: @actividad_id).take

		@observaciones= ObservacionActividadAdecuacion.where(adecuacionactividad_id: aa.id)

		@observaciones.each do |obs|
			if(obs.observaciones != "")
			@boolobs = 1
			end
		end


		@observaciones.each do |obs|

			rev = Revision.find(obs.revision_id)

			entidad = Usuarioentidad.where(usuario_id: rev.usuario_id).take

SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 1 AND `estatus_adecuacion`.`actual` = 1 LIMIT 1
---
		@bool_enviado = 0
		if (session[:entidad_id] >= 7 && session[:entidad_id] <= 12)
		#Usuario comision
			estatusI = EstatusAdecuacion.where(adecuacion_id: @adecuacion.id, actual: 1).take #Estatus enviado a comision de investigacioni

SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 12 LIMIT 1
SELECT  `informe`.* FROM `informe` WHERE `informe`.`id` = 60 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 15 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 15 LIMIT 1
SELECT  `respaldo`.* FROM `respaldo` WHERE `respaldo`.`adecuacion_id` = 19 AND `respaldo`.`informe_id` = 60 AND `respaldo`.`actual` = 1 LIMIT 1
UPDATE `respaldo` SET `estatus` = 'Aprobado por Consejo de Facultad con Observaciones', `actual` = 0 WHERE `respaldo`.`id` = 6
SELECT  `estatus_informe`.* FROM `estatus_informe` WHERE `estatus_informe`.`informe_id` = 60 AND `estatus_informe`.`actual` = 1 LIMIT 1
UPDATE `estatus_informe` SET `actual` = 0 WHERE `estatus_informe`.`id` = 108
INSERT INTO `estatus_informe` (`informe_id`, `fecha`, `estatus_id`, `actual`) VALUES (60, '2017-12-01', 8, 1)
SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 39 LIMIT 1
INSERT INTO `notificacion` (`instructor_id`, `tutor_id`, `adecuacion_id`, `informe_id`, `actual`, `mensaje`) VALUES (39, 38, 19, 60, 1, '[2017-12-01] El Primer Informe Semestral de Pepe Rodriguez ha sido aprobado por Comisión de Investigación y fue enviada a Consejo de Escuela.')
---
	def cambiar_estatusI
		@informe_id = params[:informe_id].to_i
		rechazar = params[:rechazar].to_i
		@cjpTipo=Usuario.find(session[:usuario_id]).tipo
		informeAct = Informe.where(id: @informe_id).take
		session[:plan_id] = informeAct.planformacion_id
		adec = Adecuacion.where(planformacion_id: informeAct.planformacion_id).take
		session[:adecuacion_id] = adec.id

		if (session[:entidad_id] >= 7 && session[:entidad_id] <= 12)
			@document = Respaldo.where(adecuacion_id: session[:adecuacion_id], informe_id: @informe_id, actual: 1).take
			@document.estatus = "Enviado a Consejo de Escuela"
			@document.save
			cambio_act = EstatusInforme.where(informe_id: @informe_id, actual: 1).take
	      	cambio_act.actual = 0
	      	cambio_act.save
			cambio_est = EstatusInforme.new
			cambio_est.informe_id = @informe_id
			cambio_est.fecha = Time.now
			cambio_est.estatus_id = 8
			cambio_est.actual = 1
			cambio_est.save
			plan = Planformacion.find(session[:plan_id])
			cambio_est.fecha = Time.now
			notific = Notificacion.new
			notific.instructor_id = plan.instructor_id
			notific.tutor_id = informeAct.tutor_id
			notific.adecuacion_id = session[:adecuacion_id]
			notific.informe_id = @informe_id
			notific.actual = 1
			person = Persona.where(usuario_id: plan.instructor_id).take
			notificacionfecha = Date.current.to_s
			notific.mensaje = "[" + notificacionfecha + "] El " + session[:nombre_informe] + " de " + person.nombres.to_s.split.map(&:capitalize).join(' ') + " " + person.apellidos.to_s.split.map(&:capitalize).join(' ') + " ha sido aprobado por Comisión de Investigación y fue enviada a Consejo de Escuela."
			notific.save

SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`entidad_id` = 8 LIMIT 1
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`escuela_id` = 2 AND `usuarioentidad`.`entidad_id` = 2 LIMIT 1
---
			notific3.actual = 4   #Consejo de Escuela
			notific3.mensaje = "[" + notificacionfecha + "] Ha recibido un nuevo Informe: ' " + session[:nombre_informe]+ " ' de " + person.nombres.to_s.split.map(&:capitalize).join(' ') + " " + person.apellidos.to_s.split.map(&:capitalize).join(' ') + ", favor aprobar y enviar a la siguiente entidad."
			notific3.save
	        user =Usuarioentidad.where(entidad_id: session[:entidad_id]).take
			if(user.escuela_id == 1)
				uentidad = Usuarioentidad.where(escuela_id: user.escuela_id, entidad_id: 1).take

SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 3 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 1 LIMIT 1
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 38 LIMIT 1
SELECT  `escuela`.* FROM `escuela` WHERE `escuela`.`id` = 2 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 1 LIMIT 1
SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 38 LIMIT 1
SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 1 AND `adecuacion_actividad`.`semestre` = 1
SELECT  `actividad`.* FROM `actividad` WHERE `actividad`.`id` = 1 LIMIT 1
---
	def vista_previa
		session[:informe_id]=nil
		@cjpTipo=Usuario.find(session[:usuario_id]).tipo
		@fechaActual = Date.current.to_s
		@plan= Planformacion.find(session[:plan_id])
		@fechaConcurso = @plan.fecha_inicio
		@usere= Usuarioentidad.where(usuario_id: @plan.instructor_id).take
		@escuela= Escuela.find(@usere.escuela_id)
		@adecuacion= Adecuacion.where(planformacion_id: @plan.id).take
		@adscripcion_docencia= @plan.adscripcion_docencia
		@adscripcion_investigacion= @plan.adscripcion_investigacion
		@persona= Persona.where(usuario_id: @plan.instructor_id).take
		@cpinstruccion = @persona.grado_instruccion
		@user = Usuario.find(@plan.instructor_id)
		@cpTutor= Persona.where(usuario_id: @plan.tutor_id).take
		@cpTutorEmail= Usuario.find(@plan.tutor_id).email

		@docencia='docencia'
		@investigacion= 'investigacion'
		@formacion= 'formacion'
		@extension= 'extension'
		@obligatoria= 'obligatoria'
		@otra= 'otra'

		@nombre = session[:nombre_usuario]
		@instructorName = session[:instructorName]

		actividades = AdecuacionActividad.where(adecuacion_id: @adecuacion.id, semestre: 0)
			if !actividades.blank?

SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 1 AND `estatus_adecuacion`.`actual` = 1 LIMIT 1
---
		@bool_enviado = 0
		if (session[:entidad_id] >= 7 && session[:entidad_id] <= 12)
		#Usuario comision
			estatusI = EstatusAdecuacion.where(adecuacion_id: @adecuacion.id, actual: 1).take #Estatus enviado a comision de investigacioni

SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 3 LIMIT 1
SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`id` = 19 LIMIT 1
SELECT  `estatus_adecuacion`.* FROM `estatus_adecuacion` WHERE `estatus_adecuacion`.`adecuacion_id` = 19 AND `estatus_adecuacion`.`actual` = 1 LIMIT 1
UPDATE `estatus_adecuacion` SET `actual` = 0 WHERE `estatus_adecuacion`.`id` = 26
INSERT INTO `estatus_adecuacion` (`adecuacion_id`, `fecha`, `estatus_id`, `actual`) VALUES (19, '2017-09-19', 8, 1)
SELECT `adecuacion_actividad`.* FROM `adecuacion_actividad` WHERE `adecuacion_actividad`.`adecuacion_id` = 19
SELECT `observacion_actividad_adecuacion`.* FROM `observacion_actividad_adecuacion` WHERE `observacion_actividad_adecuacion`.`adecuacionactividad_id` = 399 AND `observacion_actividad_adecuacion`.`actual` = 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 15 LIMIT 1
SELECT  `respaldo`.* FROM `respaldo` WHERE `respaldo`.`adecuacion_id` = 19 AND `respaldo`.`informe_id` IS NULL AND `respaldo`.`actual` = 1 LIMIT 1
UPDATE `respaldo` SET `estatus` = 'Aprobado por Consejo de Facultad', `actual` = 0 WHERE `respaldo`.`id` = 1
---
	def cambiar_estatusA
		@adecuacion_id = params[:adecuacion_id].to_i
		rechazar = params[:rechazar].to_i
		@cjpTipo=Usuario.find(session[:usuario_id]).tipo

		if (session[:entidad_id] >= 7 && session[:entidad_id] <= 12)
		#Usuario comision
			cambio_act = EstatusAdecuacion.where(adecuacion_id: @adecuacion_id, actual: 1).take
	  		cambio_act.actual = 0
	  		cambio_act.save
			cambio_est = EstatusAdecuacion.new
			cambio_est.adecuacion_id = @adecuacion_id
			cambio_est.fecha = Time.now
			cambio_est.estatus_id = 8
			cambio_est.actual = 1
			cambio_est.save
			cambio_est.fecha = Time.now
			adac = AdecuacionActividad.where(adecuacion_id: @adecuacion_id).all
			adac.each do |adaa|
				oa = ObservacionActividadAdecuacion.where(adecuacionactividad_id: adaa.id, actual: 1).all
				oa.each do |oaa|
					oaa.fecha = Time.now
					oaa.actual = 0
					oaa.save
				end
			end

			plan= Planformacion.find(session[:plan_id])
			notific = Notificacion.new
			@document = Respaldo.where(adecuacion_id: session[:adecuacion_id], informe_id: nil, actual: 1).take
			@document.estatus = "Enviado a Consejo de Escuela"
			@document.save

SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 49 LIMIT 1
INSERT INTO `notificacion` (`instructor_id`, `tutor_id`, `adecuacion_id`, `actual`, `mensaje`) VALUES (49, 48, 19, 1, '[2017-09-19] La adecuación de Pedro Alejandro ha sido aprobada por Comisión de Investigación y fue enviada a Consejo de Escuela.')
---
	        notific.adecuacion_id = session[:adecuacion_id]
	        notific.informe_id = nil
	        notific.actual = 1
	        person = Persona.where(usuario_id: plan.instructor_id).take
	        notificacionfecha = Date.current.to_s
	    	notific.mensaje = "[" + notificacionfecha + "] La adecuación de "+ person.nombres.to_s.split.map(&:capitalize).join(' ') + " " + person.apellidos.to_s.split.map(&:capitalize).join(' ') + " ha sido aprobada por Comisión de Investigación y fue enviada a Consejo de Escuela."
	    	notific.save

SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`entidad_id` = 8 LIMIT 1
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`escuela_id` = 2 AND `usuarioentidad`.`entidad_id` = 2 LIMIT 1
---
	    	notific3.mensaje = "[" + notificacionfecha + "] Se ha recibido una nueva Adecuación: "+ person.nombres.to_s.split.map(&:capitalize).join(' ') + " " + person.apellidos.to_s.split.map(&:capitalize).join(' ') + ", favor aprobar y enviar a la siguiente entidad."
	    	notific3.save

			 user =Usuarioentidad.where(entidad_id: session[:entidad_id]).take
	          if(user.escuela_id == 1)
	            uentidad = Usuarioentidad.where(escuela_id: user.escuela_id, entidad_id: 1).take