forminst_new1/app/controllers/secretarias_controller.rb

SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 36 LIMIT 1
SELECT `departamento`.* FROM `departamento` WHERE `departamento`.`escuela_id` = 2
---
	def agregarTutor
		if session[:usuario_id]

			if $modulo != "agregarTutor"
				$cpnombre = nil
				$cpapellido = nil
				$cpci = nil
				$cpcorreo = nil
				$cptlf = nil
				$cpotlf = nil
				$cpfechanac = nil
				$cpdir = nil
				$cpgradoi = nil
				$cparea = nil
				$cpsubarea = nil
				$cpfechaconcurso = nil
				$cpjrtutores = nil
				$cpuad = nil
				$cpuai = nil
			end

			cpSecretariaID = session[:usuario_id]
			cpSecretaria = Usuarioentidad.where(usuario_id: cpSecretariaID).take
			cpSecretariaEscuela = cpSecretaria.escuela_id
			uentidad = Departamento.where(escuela_id: cpSecretariaEscuela)

SELECT `persona`.* FROM `persona`
---
			$modulo = "agregarTutor"

			@nombre = session[:nombre_usuario]
			@personas = Persona.all

SELECT `persona`.* FROM `persona`
SELECT `usuario`.* FROM `usuario`
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 36 LIMIT 1
---
	def guarda_tutor
		if session[:usuario_id]

			haceralgo = "Si"

			cjprpersonas = Persona.where(ci: params[:CI]).take
			if !cjprpersonas.blank?
				haceralgo = "No"
			end

			cjprpersonas = Usuario.where(email: params[:correo]).take
			if !cjprpersonas.blank?
				haceralgo = "No"
			end

			cjprpersonas = Usuario.where(user: params[:correo]).take
			if !cjprpersonas.blank?
				haceralgo = "No"
			end

			if haceralgo == "Si"

				if params[:depto].to_i != 0
					cpSecretariaID = session[:usuario_id]
					cpSecretaria = Usuarioentidad.where(usuario_id: cpSecretariaID).take

INSERT INTO `usuario` (`user`, `ldap`, `activo`, `password`, `email`, `tipo`) VALUES ('ana.moralesbezeira', 0, 1, '12305110', 'ana.moralesbezeira', 'Docente')
---
					cpusuario.activo = 1
					cpusuario.tipo = "Docente"
					cpusuario.email = params[:correo].to_s
					cpusuario.save

INSERT INTO `persona` (`usuario_id`, `nombres`, `apellidos`, `fecha_nacimiento`, `ci`, `telefono1`, `telefono2`, `direccion`, `grado_instruccion`, `area`, `subarea`) VALUES (37, 'Ana Verónica', 'Morales Bezeira', '1975-01-14', '12305110', '4142723601', '2126051329', 'Urb. Bello Montre, Av. Caroní, Edif. San Rafel II.', 'Msc. en Telemática', 'Computación', 'Telecomunicaciones y Redes')
---
					cppersona.grado_instruccion = params[:GradoI].to_s
					cppersona.area = params[:Area].to_s
					cppersona.subarea = params[:Subarea].to_s
					cppersona.save

INSERT INTO `notificacion` (`tutor_id`, `actual`, `mensaje`) VALUES (37, 1, '[2017-06-20] ¡Bienvenido a FORMINST! Se ha creado su perfil de Tutor.')
SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 37 LIMIT 1
---
			        notific.actual = 1
			        notificacionfecha = Date.current.to_s
		        	notific.mensaje = "[" + notificacionfecha + "] ¡Bienvenido a FORMINST! Se ha creado su perfil de Tutor."
		        	notific.save
					remitente3 = Usuario.where(id: notific.tutor_id).take

SELECT `persona`.* FROM `persona`
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 36 LIMIT 1
SELECT `departamento`.* FROM `departamento` WHERE `departamento`.`escuela_id` = 1
---
	def agregarInstructor
		if session[:usuario_id]

			if $modulo != "agregarInstructor"
				$cpnombre = nil
				$cpapellido = nil
				$cpci = nil
				$cpcorreo = nil
				$cptlf = nil
				$cpotlf = nil
				$cpfechanac = nil
				$cpdir = nil
				$cpgradoi = nil
				$cparea = nil
				$cpsubarea = nil
				$cpfechaconcurso = nil
				$cpjrtutores = nil
				$cpuad = nil
				$cpuai = nil
			end

			$modulo = "agregarInstructor"

			i = 1
			j = 1
			nombre = "hola"
			cpid = 1

			@nombre = session[:nombre_usuario]
			@personas = Persona.all
			session[:personas] = @personas.as_json(only: [:usuario_id, :nombres, :apellidos])
			cpSecretariaID = session[:usuario_id]
			cpSecretaria = Usuarioentidad.where(usuario_id: cpSecretariaID).take
			cpSecretariaEscuela = cpSecretaria.escuela_id

			deptos = Departamento.where(escuela_id: cpSecretariaEscuela)

SELECT `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`escuela_id` = 2 AND `usuarioentidad`.`entidad_id` = 18
---
				cpcontador1 = cpcontador1 + 1
			end

			uentidad = Usuarioentidad.where(escuela_id: cpSecretariaEscuela, entidad_id: 18)

SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 1 LIMIT 1
---
			cpcontador = cpcontador + 1

			uentidad.each do |usuarioentidad|
				cppersona = Persona.find_by usuario_id: usuarioentidad.usuario_id

SELECT `persona`.* FROM `persona`
SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 37 LIMIT 1
SELECT `usuario`.* FROM `usuario`
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 36 LIMIT 1
---
	def guarda_instructor
		if session[:usuario_id]

			haceralgo = "Si"

			i = 1
			j = 1
			nombre = "hola"
			cpid = 1

			cjprpersonas = Persona.where(ci: params[:CI]).take
			if !cjprpersonas.blank?
				haceralgo = "No"
			end

			cjprpersonas = Usuario.where(email: params[:correo]).take
			if !cjprpersonas.blank?
				haceralgo = "No"
			end

			cjprpersonas = Usuario.where(user: params[:correo]).take
			if !cjprpersonas.blank?
				haceralgo = "No"
			end

			puts "holaaaaaaaaaaaaaaaa"
			puts haceralgo

			if haceralgo == "Si"
				if params[:JRTutores].to_s != "0" && params[:depto].to_i != 0
					profenti = Usuarioentidad.where(usuario_id: params[:JRTutores]).take

INSERT INTO `usuario` (`user`, `ldap`, `activo`, `password`, `email`, `tipo`) VALUES ('sonofgrendel', 0, 1, '18810993', 'sonofgrendel', 'Docente')
---
						cpusuario.activo = 1
						cpusuario.tipo = "Docente"
						cpusuario.email = params[:correo]
						cpusuario.save

INSERT INTO `persona` (`usuario_id`, `nombres`, `apellidos`, `fecha_nacimiento`, `ci`, `telefono1`, `telefono2`, `direccion`, `grado_instruccion`, `area`, `subarea`) VALUES (38, 'Miguel Angel', 'Astor Romero', '1989-09-09', '18810993', '4141253223', '2126050984', 'Av. este 5, Esquina San Ramón  a Canónigos, Edif. Hyperion, Piso 7, Apto. PH, Altagracia Caracas.', 'Licenciado', 'Computación', 'Telecomunicaciones y Redes')
---
						cppersona.grado_instruccion = params[:GradoI]
						cppersona.area = params[:Area]
						cppersona.subarea = params[:Subarea]
						cppersona.save

INSERT INTO `planformacion` (`fecha_inicio`, `fecha_fin`, `activo`, `instructor_id`, `tutor_id`, `adscripcion_docencia`, `adscripcion_investigacion`) VALUES ('2016-10-07', '2018-10-07', 1, 38, 37, 'Escuela de Computacion', 'Centro de Investigación de Comunicaciones de Comunicaciones y Redes (CICORE), Laboratorio ICARO')
---
						cpplanformacion.tutor_id = params[:JRTutores]
						cpplanformacion.adscripcion_docencia = params[:UAD]
						cpplanformacion.adscripcion_investigacion = params[:UAI]
						cpplanformacion.save

INSERT INTO `adecuacion` (`planformacion_id`, `tutor_id`, `fecha_modificacion`, `fecha_creacion`) VALUES (15, 37, '2016-10-07', '2016-10-07')
---
						cpAdecuacion.tutor_id = cpplanformacion.tutor_id
						cpAdecuacion.fecha_creacion = cpplanformacion.fecha_inicio
						cpAdecuacion.fecha_modificacion = cpplanformacion.fecha_inicio
						cpAdecuacion.save

INSERT INTO `estatus_adecuacion` (`adecuacion_id`, `fecha`, `estatus_id`, `actual`) VALUES (19, '2017-06-20', 6, 1)
SELECT  `instructortutor`.* FROM `instructortutor` WHERE `instructortutor`.`instructor_id` = 38 AND `instructortutor`.`tutor_id` = 37 LIMIT 1
---
						cpEstatus_Adecuacion.fecha = Date.current.to_s
						cpEstatus_Adecuacion.estatus_id = 6
						cpEstatus_Adecuacion.actual = 1
						cpEstatus_Adecuacion.save

						cpinstructortutor = Instructortutor.where(instructor_id: cpplanformacion.instructor_id, tutor_id: params[:JRTutores]).take

INSERT INTO `instructortutor` (`instructor_id`, `tutor_id`, `actual`) VALUES (38, 37, 1)
---
						else
							cpinstructortutor.actual = 1
						end
						cpinstructortutor.save

SELECT  `adecuacion`.* FROM `adecuacion` WHERE `adecuacion`.`planformacion_id` = 15 LIMIT 1
SELECT  `planformacion`.* FROM `planformacion` WHERE `planformacion`.`id` = 15 LIMIT 1
---
				        notific.instructor_id = cpusuario.id
				        notific.tutor_id = params[:JRTutores]
				        profe = Persona.where(usuario_id: params[:JRTutores]).take
				        adecc = Adecuacion.where(planformacion_id: cpAdecuacion.planformacion_id).take
				        plan = Planformacion.where(id: cpAdecuacion.planformacion_id).take

INSERT INTO `notificacion` (`instructor_id`, `tutor_id`, `adecuacion_id`, `actual`, `mensaje`) VALUES (38, 37, 19, 1, '[2017-06-20] Se le ha asignado el Plan formación de Miguel Angel Astor Romero, recuerde crear la adecuación correspondiente y enviarla.')
---
				        notific.actual = 1
				        notificacionfecha = Date.current.to_s
			        	notific.mensaje = "[" + notificacionfecha + "] Se le ha asignado el Plan formación de " + cppersona.nombres.to_s.split.map(&:capitalize).join(' ') + " " + cppersona.apellidos.to_s.split.map(&:capitalize).join(' ') + ", recuerde crear la adecuación correspondiente y enviarla."
			        	notific.save

SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 37 LIMIT 1
---
				        notificacionfecha = Date.current.to_s
			        	notific2.mensaje = "[" + notificacionfecha + "] ¡Bienvenido a FORMINST! Se le ha asignado a  " + profe.nombres.to_s.split.map(&:capitalize).join(' ') + " " + profe.apellidos.to_s.split.map(&:capitalize).join(' ') + " como tutor de su Plan de formación."
			        	notific2.save
						remitente3 = Usuario.where(id: notific.tutor_id).take

SELECT `persona`.* FROM `persona`
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 36 LIMIT 1
SELECT `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`escuela_id` = 2 AND `usuarioentidad`.`entidad_id` = 19
---
	def modificarInstructor
		if session[:usuario_id]

			if $modulo != "modificarInstructor"
				$cpnombre = nil
				$cpapellido = nil
				$cpci = nil
				$cpcorreo = nil
				$cptlf = nil
				$cpotlf = nil
				$cpfechanac = nil
				$cpdir = nil
				$cpgradoi = nil
				$cparea = nil
				$cpsubarea = nil
				$cpfechaconcurso = nil
				$cpjrtutores = nil
				$cpuad = nil
				$cpuai = nil
			end

			$modulo = "modificarInstructor"

			i = 1
			j = 1
			nombre = "hola"
			cpid = 1
			@nombre = session[:nombre_usuario]
			@personas = Persona.all
			session[:personas] = @personas.as_json(only: [:usuario_id, :nombres, :apellidos])
			cpSecretariaID = session[:usuario_id]
			cpSecretaria = Usuarioentidad.where(usuario_id: cpSecretariaID).take
			cpSecretariaEscuela = cpSecretaria.escuela_id

			uentidad = Usuarioentidad.where(escuela_id: cpSecretariaEscuela, entidad_id: 19)

SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 34 LIMIT 1
---
			cpcontador = cpcontador + 1

			uentidad.each do |usuarioentidad|
				cppersona = Persona.find_by usuario_id: usuarioentidad.usuario_id

SELECT `persona`.* FROM `persona`
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 36 LIMIT 1
SELECT `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`escuela_id` = 2 AND `usuarioentidad`.`entidad_id` = 18
---
	def modificarTutor
		if session[:usuario_id]

			if $modulo != "modificarTutor"
				$cpnombre = nil
				$cpapellido = nil
				$cpci = nil
				$cpcorreo = nil
				$cptlf = nil
				$cpotlf = nil
				$cpfechanac = nil
				$cpdir = nil
				$cpgradoi = nil
				$cparea = nil
				$cpsubarea = nil
				$cpfechaconcurso = nil
				$cpjrtutores = nil
				$cpuad = nil
				$cpuai = nil
			end

			$modulo = "modificarTutor"

			i = 1
			j = 1
			nombre = "hola"
			cpid = 1
			@nombre = session[:nombre_usuario]
			@personas = Persona.all
			session[:personas] = @personas.as_json(only: [:usuario_id, :nombres, :apellidos])
			cpSecretariaID = session[:usuario_id]
			cpSecretaria = Usuarioentidad.where(usuario_id: cpSecretariaID).take
			cpSecretariaEscuela = cpSecretaria.escuela_id

			uentidad = Usuarioentidad.where(escuela_id: cpSecretariaEscuela, entidad_id: 18)

SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 1 LIMIT 1
---
			cpcontador = cpcontador + 1

			uentidad.each do |usuarioentidad|
				cppersona = Persona.find_by usuario_id: usuarioentidad.usuario_id

SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 37 LIMIT 1
SELECT  `usuario`.* FROM `usuario` WHERE `usuario`.`id` = 37 LIMIT 1
SELECT  `usuarioentidad`.* FROM `usuarioentidad` WHERE `usuarioentidad`.`usuario_id` = 37 LIMIT 1
---
	def modificarTutor2
		if session[:usuario_id]

			if params[:JRTutores].to_s != "0"

				$id_tutor_seleccionado = params[:JRTutores].to_s
				cppersona = Persona.find_by usuario_id: params[:JRTutores].to_s
				cpusuario = Usuario.find_by id: params[:JRTutores].to_s
				cpuentidad = Usuarioentidad.find_by usuario_id: params[:JRTutores].to_s