forminst_new1/app/views/iniciotutor/ver_detalles_adecuacion.html.erb

                <tr>
                  <td class="text-left"> <%= Persona.where(usuario_id: asig.tutor_id).take.nombres + " " + Persona.where(usuario_id: asig.tutor_id).take.apellidos %> </td>
---
SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 38 LIMIT 1