forminst_new1/app/views/inicioinstructor/ver_detalles_adecuacion.html.erb

SELECT  `persona`.* FROM `persona` WHERE `persona`.`usuario_id` = 48 LIMIT 1
---
                <tr>
                  <td class="text-left"> <%= Persona.where(usuario_id: asig.tutor_id).take.nombres + " " + Persona.where(usuario_id: asig.tutor_id).take.apellidos %> </td>